[
	{
		"id": "department-of-commerce",
		"name": "Department Of Commerce",
		"children": [
			{
				"id": "international-trade-administration",
				"name": "International Trade Administration",
				"description": "For necessary expenses for international trade activities of the Department of Commerce provided for by law, and for engaging in trade promotional activities abroad, including expenses of grants and cooperative agreements for the purpose of promoting exports of United States firms, without regard to sections 3702 and 3703 of title 44, United States Code; full medical coverage for dependent members of immediate families of employees stationed overseas and employees temporarily posted overseas; travel and transportation of employees of the International Trade Administration between two points abroad, without regard to section 40118 of title 49, United States Code; employment of citizens of the United States and aliens by contract for services; rental of space abroad for periods not exceeding 10 years, and expenses of alteration, repair, or improvement; purchase or construction of temporary demountable exhibition structures for use abroad; payment of tort claims, in the manner authorized in the first paragraph of section 2672 of title 28, United States Code, when such claims arise in foreign countries; not to exceed $294,300 for official representation expenses abroad; purchase of passenger motor vehicles for official use abroad, not to exceed $45,000 per vehicle; obtaining insurance on official motor vehicles; and rental of tie lines.",
				"amount": 495000000.0
			},
			{
				"id": "bureau-of-industry-and-security",
				"name": "Bureau Of Industry And Security",
				"description": "For necessary expenses for export administration and national security activities of the Department of Commerce, including costs associated with the performance of export administration field activities both domestically and abroad; full medical coverage for dependent members of immediate families of employees stationed overseas; employment of citizens of the United States and aliens by contract for services abroad; payment of tort claims, in the manner authorized in the first paragraph of section 2672 of title 28, United States Code, when such claims arise in foreign countries; not to exceed $13,500 for official representation expenses abroad; awards of compensation to informers under the Export Control Reform Act of 2018 (subtitle B of title XVII of the John S. McCain National Defense Authorization Act for Fiscal Year 2019; Public Law 115–232; 132 Stat. 2208; 50 U.S.C. 4801 et seq.), and as authorized by section 1(b) of the Act of June 15, 1917 (40 Stat. 223; 22 U.S.C. 401(b)); and purchase of passenger motor vehicles for official use and motor vehicles for law enforcement use with special requirement vehicles eligible for purchase without regard to any price limitation otherwise established by law.",
				"amount": 118050000.0
			},
			{
				"id": "economic-development-administration",
				"name": "Economic Development Administration",
				"children": [
					{
						"id": "economic-development-assistance-programs",
						"name": "Economic Development Assistance Programs",
						"description": "For grants for economic development assistance as provided by the Public Works and Economic Development Act of 1965, for trade adjustment assistance, and for grants authorized by section 27 of the Stevenson-Wydler Technology Innovation Act of 1980 (15 U.S.C. 3722).",
						"amount": 265000000.0
					},
					{
						"id": "salaries-and-expenses-13",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of administering the economic development assistance programs as provided for by law.",
						"amount": 39000000.0
					}
				]
			},
			{
				"id": "minority-business-development-agency",
				"name": "Minority Business Development Agency",
				"description": "For necessary expenses of the Department of Commerce in fostering, promoting, and developing minority business enterprise, including expenses of grants, contracts, and other agreements with public or private organizations.",
				"amount": 40000000.0
			},
			{
				"id": "economic-and-statistical-analysis",
				"name": "Economic And Statistical Analysis",
				"description": "For necessary expenses, as authorized by law, of economic and statistical analysis programs of the Department of Commerce.",
				"amount": 101000000.0
			},
			{
				"id": "bureau-of-the-census",
				"name": "Bureau Of The Census",
				"children": [
					{
						"id": "current-surveys-and-programs",
						"name": "Current Surveys And Programs",
						"description": "For necessary expenses for collecting, compiling, analyzing, preparing, and publishing statistics, provided for by law.",
						"amount": 270000000.0
					},
					{
						"id": "periodic-censuses-and-programs",
						"name": "Periodic Censuses And Programs",
						"description": "For necessary expenses for collecting, compiling, analyzing, preparing, and publishing statistics for periodic censuses and programs provided for by law.",
						"amount": 3551388000.0
					}
				]
			},
			{
				"id": "national-telecommunications-and-information-administration",
				"name": "National Telecommunications And Information Administration",
				"description": "For necessary expenses, as provided for by law, of the National Telecommunications and Information Administration (NTIA).",
				"amount": 39500000.0
			},
			{
				"id": "united-states-patent-and-trademark-office",
				"name": "United States Patent And Trademark Office",
				"description": "For necessary expenses of the United States Patent and Trademark Office (USPTO) provided for by law, including defense of suits instituted against the Under Secretary of Commerce for Intellectual Property and Director of the USPTO.",
				"amount": 3370000000.0
			},
			{
				"id": "national-institute-of-standards-and-technology",
				"name": "National Institute Of Standards And Technology",
				"children": [
					{
						"id": "scientific-and-technical-research-and-services",
						"name": "Scientific And Technical Research And Services",
						"description": "For necessary expenses of the National Institute of Standards and Technology (NIST).",
						"amount": 724500000.0
					},
					{
						"id": "industrial-technology-services",
						"name": "Industrial Technology Services",
						"description": "For necessary expenses for industrial technology services.",
						"amount": 155000000.0
					},
					{
						"id": "construction-of-research-facilities",
						"name": "Construction Of Research Facilities",
						"description": "For construction of new research facilities, including architectural and engineering design, and for renovation and maintenance of existing facilities, not otherwise provided for the National Institute of Standards and Technology, as authorized by sections 13 through 15 of the National Institute of Standards and Technology Act (15 U.S.C. 278c–278e).",
						"amount": 106000000.0
					}
				]
			},
			{
				"id": "national-oceanic-and-atmospheric-administration",
				"name": "National Oceanic And Atmospheric Administration",
				"children": [
					{
						"id": "operations%2C-research%2C-and-facilities",
						"name": "Operations, Research, And Facilities",
						"description": "For necessary expenses of activities authorized by law for the National Oceanic and Atmospheric Administration, including maintenance, operation, and hire of aircraft and vessels; pilot programs for state-led fisheries management, notwithstanding any other provision of law; grants, contracts, or other payments to nonprofit organizations for the purposes of conducting activities pursuant to cooperative agreements; and relocation of facilities.",
						"amount": 3596997000.0
					},
					{
						"id": "procurement%2C-acquisition-and-construction",
						"name": "Procurement, Acquisition And Construction",
						"description": "For procurement, acquisition and construction of capital assets, including alteration and modification costs, of the National Oceanic and Atmospheric Administration.",
						"amount": 1755349000.0
					},
					{
						"id": "pacific-coastal-salmon-recovery",
						"name": "Pacific Coastal Salmon Recovery",
						"description": "For necessary expenses associated with the restoration of Pacific salmon populations.",
						"amount": 65000000.0
					},
					{
						"id": "fishery-disaster-assistance",
						"name": "Fishery Disaster Assistance",
						"description": "For the necessary expenses associated with the mitigation of fishery disasters.",
						"amount": 15000000.0
					}
				]
			},
			{
				"id": "departmental-management-3",
				"name": "Departmental Management",
				"children": [
					{
						"id": "salaries-and-expenses-14",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses for the management of the Department of Commerce provided for by law, including not to exceed $4,500 for official reception and representation.",
						"amount": 63000000.0
					},
					{
						"id": "office-of-inspector-general-10",
						"name": "Office Of Inspector General",
						"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978 (5 U.S.C. App.).",
						"amount": 34744000.0
					}
				]
			}
		]
	},
	{
		"id": "department-of-justice",
		"name": "Department Of Justice",
		"children": [
			{
				"id": "general-administration-2",
				"name": "General Administration",
				"children": [
					{
						"id": "salaries-and-expenses-15",
						"name": "Salaries And Expenses",
						"description": "For expenses necessary for the administration of the Department of Justice.",
						"amount": 113000000.0
					},
					{
						"id": "justice-information-sharing-technology",
						"name": "Justice Information Sharing Technology",
						"description": "For necessary expenses for information sharing technology, including planning, development, deployment and departmental direction.",
						"amount": 32000000.0
					},
					{
						"id": "executive-office-for-immigration-review",
						"name": "Executive Office For Immigration Review",
						"description": "For expenses necessary for the administration of immigration-related activities of the Executive Office for Immigration Review.",
						"amount": 563407000.0
					},
					{
						"id": "office-of-inspector-general-11",
						"name": "Office Of Inspector General",
						"description": "For necessary expenses of the Office of Inspector General.",
						"amount": 101000000.0
					}
				]
			},
			{
				"id": "united-states-parole-commission",
				"name": "United States Parole Commission",
				"description": "For necessary expenses of the United States Parole Commission as authorized.",
				"amount": 13000000.0
			},
			{
				"id": "legal-activities",
				"name": "Legal Activities",
				"children": [
					{
						"id": "salaries-and-expenses%2C-antitrust-division",
						"name": "Salaries And Expenses, Antitrust Division",
						"description": "For expenses necessary for the enforcement of antitrust and kindred laws.",
						"amount": 164977000.0
					},
					{
						"id": "salaries-and-expenses%2C-united-states-attorneys",
						"name": "Salaries And Expenses, United States Attorneys",
						"description": "For necessary expenses of the Offices of the United States Attorneys, including inter-governmental and cooperative agreements.",
						"amount": 2212000000.0
					},
					{
						"id": "united-states-trustee-system-fund",
						"name": "United States Trustee System Fund",
						"description": "For necessary expenses of the United States Trustee Program, as authorized.",
						"amount": 226000000.0
					},
					{
						"id": "salaries-and-expenses%2C-foreign-claims-settlement-commission",
						"name": "Salaries And Expenses, Foreign Claims Settlement Commission",
						"description": "For expenses necessary to carry out the activities of the Foreign Claims Settlement Commission, including services as authorized by section 3109 of title 5, United States Code.",
						"amount": 2409000.0
					},
					{
						"id": "fees-and-expenses-of-witnesses",
						"name": "Fees And Expenses Of Witnesses",
						"description": "For fees and expenses of witnesses, for expenses of contracts for the procurement and supervision of expert witnesses, for private counsel expenses, including advances, and for expenses of foreign counsel.",
						"amount": 270000000.0
					},
					{
						"id": "salaries-and-expenses%2C-community-relations-service",
						"name": "Salaries And Expenses, Community Relations Service",
						"description": "For necessary expenses of the Community Relations Service.",
						"amount": 15500000.0
					},
					{
						"id": "assets-forfeiture-fund",
						"name": "Assets Forfeiture Fund",
						"description": "For expenses authorized by subparagraphs (B), (F), and (G) of section 524(c)(1) of title 28, United States Code.",
						"amount": 20514000.0
					}
				]
			},
			{
				"id": "united-states-marshals-service",
				"name": "United States Marshals Service",
				"children": [
					{
						"id": "salaries-and-expenses-16",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the United States Marshals Service.",
						"amount": 1358000000.0
					},
					{
						"id": "construction-3",
						"name": "Construction",
						"description": "For construction in space controlled, occupied or utilized by the United States Marshals Service for prisoner holding and related support.",
						"amount": 15000000.0
					},
					{
						"id": "federal-prisoner-detention",
						"name": "Federal Prisoner Detention",
						"description": "For necessary expenses related to United States prisoners in the custody of the United States Marshals Service as authorized by section 4013 of title 18, United States Code.",
						"amount": 1552397000.0
					}
				]
			},
			{
				"id": "national-security-division",
				"name": "National Security Division",
				"description": "For expenses necessary to carry out the activities of the National Security Division.",
				"amount": 101369000.0
			},
			{
				"id": "interagency-law-enforcement",
				"name": "Interagency Law Enforcement",
				"description": "For necessary expenses for the identification, investigation, and prosecution of individuals associated with the most significant drug trafficking organizations, transnational organized crime, and money laundering organizations not otherwise provided for, to include inter-governmental agreements with State and local law enforcement agencies engaged in the investigation and prosecution of individuals involved in transnational organized crime and drug trafficking.",
				"amount": 560000000.0
			},
			{
				"id": "federal-bureau-of-investigation",
				"name": "Federal Bureau Of Investigation",
				"children": [
					{
						"id": "salaries-and-expenses-17",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Federal Bureau of Investigation for detection, investigation, and prosecution of crimes against the United States.",
						"amount": 9192137000.0
					},
					{
						"id": "construction-4",
						"name": "Construction",
						"description": "For necessary expenses, to include the cost of equipment, furniture, and information technology requirements, related to construction or acquisition of buildings, facilities and sites by purchase, or as otherwise authorized by law; conversion, modification and extension of federally owned buildings; preliminary planning and design of projects; and operation and maintenance of secure work environment facilities and secure networking capabilities.",
						"amount": 385000000.0
					}
				]
			},
			{
				"id": "drug-enforcement-administration",
				"name": "Drug Enforcement Administration",
				"description": "For necessary expenses of the Drug Enforcement Administration, including not to exceed $70,000 to meet unforeseen emergencies of a confidential character pursuant to section 530C of title 28, United States Code; and expenses for conducting drug education and training programs, including travel and related expenses for participants in such programs and the distribution of items of token value that promote the goals of such programs.",
				"amount": 2267000000.0
			},
			{
				"id": "bureau-of-alcohol%2C-tobacco%2C-firearms-and-explosives",
				"name": "Bureau Of Alcohol, Tobacco, Firearms And Explosives",
				"description": "For necessary expenses of the Bureau of Alcohol, Tobacco, Firearms and Explosives, for training of State and local law enforcement agencies with or without reimbursement, including training in connection with the training and acquisition of canines for explosives and fire accelerants detection; and for provision of laboratory assistance to State and local law enforcement agencies, with or without reimbursement.",
				"amount": 1316678000.0
			},
			{
				"id": "federal-prison-system",
				"name": "Federal Prison System",
				"children": [
					{
						"id": "salaries-and-expenses-18",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Federal Prison System for the administration, operation, and maintenance of Federal penal and correctional institutions, and for the provision of technical assistance and advice on corrections related issues to foreign governments.",
						"amount": 7250000000.0
					},
					{
						"id": "buildings-and-facilities-6",
						"name": "Buildings And Facilities",
						"description": "For planning, acquisition of sites, and construction of new facilities; purchase and acquisition of facilities and remodeling, and equipping of such facilities for penal and correctional use, including all necessary expenses incident thereto, by contract or force account; and constructing, remodeling, and equipping necessary buildings and facilities at existing penal and correctional institutions, including all necessary expenses incident thereto, by contract or force account.",
						"amount": 264000000.0
					}
				]
			},
			{
				"id": "office-on-violence-against-women",
				"name": "Office On Violence Against Women",
				"description": "For grants, contracts, cooperative agreements, and other assistance for the prevention and prosecution of violence against women, as authorized by the Omnibus Crime Control and Safe Streets Act of 1968 (34 U.S.C. 10101 et seq.) (the 1968 Act); the Violent Crime Control and Law Enforcement Act of 1994 (Public Law 103–322) (the 1994 Act); the Victims of Child Abuse Act of 1990 (Public Law 101–647) (the 1990 Act); the Prosecutorial Remedies and Other Tools to end the Exploitation of Children Today Act of 2003 (Public Law 108–21); the Juvenile Justice and Delinquency Prevention Act of 1974 (34 U.S.C. 11101 et seq.) (the 1974 Act); the Victims of Trafficking and Violence Protection Act of 2000 (Public Law 106–386) (the 2000 Act); the Violence Against Women and Department of Justice Reauthorization Act of 2005 (Public Law 109–162) (the 2005 Act); the Violence Against Women Reauthorization Act of 2013 (Public Law 113–4) (the 2013 Act); and the Rape Survivor Child Custody Act of 2015 (Public Law 114–22) (the 2015 Act); and for related victims services.",
				"amount": 497500000.0
			},
			{
				"id": "office-of-justice-programs",
				"name": "Office Of Justice Programs",
				"children": [
					{
						"id": "research%2C-evaluation-and-statistics",
						"name": "Research, Evaluation And Statistics",
						"description": "For grants, contracts, cooperative agreements, and other assistance authorized by title I of the Omnibus Crime Control and Safe Streets Act of 1968 (the 1968 Act); the Juvenile Justice and Delinquency Prevention Act of 1974 (the 1974 Act); the Missing Children's Assistance Act (34 U.S.C. 11291 et seq.); the Prosecutorial Remedies and Other Tools to end the Exploitation of Children Today Act of 2003 (Public Law 108–21); the Justice for All Act of 2004 (Public Law 108–405); the Violence Against Women and Department of Justice Reauthorization Act of 2005 (Public Law 109–162) (the 2005 Act); the Victims of Child Abuse Act of 1990 (Public Law 101–647); the Second Chance Act of 2007 (Public Law 110–199); the Victims of Crime Act of 1984 (Public Law 98–473); the Adam Walsh Child Protection and Safety Act of 2006 (Public Law 109–248) (the Adam Walsh Act); the PROTECT Our Children Act of 2008 (Public Law 110–401); subtitle D of title II of the Homeland Security Act of 2002 (Public Law 107–296) (the 2002 Act); the NICS Improvement Amendments Act of 2007 (Public Law 110–180); the Violence Against Women Reauthorization Act of 2013 (Public Law 113–4) (the 2013 Act); and other programs.",
						"amount": 80000000.0
					},
					{
						"id": "state-and-local-law-enforcement-assistance",
						"name": "State And Local Law Enforcement Assistance",
						"description": "For grants, contracts, cooperative agreements, and other assistance authorized by the Violent Crime Control and Law Enforcement Act of 1994 (Public Law 103–322) (the 1994 Act); the Omnibus Crime Control and Safe Streets Act of 1968 (the 1968 Act); the Justice for All Act of 2004 (Public Law 108–405); the Victims of Child Abuse Act of 1990 (Public Law 101–647) (the 1990 Act); the Trafficking Victims Protection Reauthorization Act of 2005 (Public Law 109–164); the Violence Against Women and Department of Justice Reauthorization Act of 2005 (Public Law 109–162) (the 2005 Act); the Adam Walsh Child Protection and Safety Act of 2006 (Public Law 109–248) (the Adam Walsh Act); the Victims of Trafficking and Violence Protection Act of 2000 (Public Law 106–386); the NICS Improvement Amendments Act of 2007 (Public Law 110–180); subtitle D of title II of the Homeland Security Act of 2002 (Public Law 107–296) (the 2002 Act); the Second Chance Act of 2007 (Public Law 110–199); the Prioritizing Resources and Organization for Intellectual Property Act of 2008 (Public Law 110–403); the Victims of Crime Act of 1984 (Public Law 98–473); the Mentally Ill Offender Treatment and Crime Reduction Reauthorization and Improvement Act of 2008 (Public Law 110–416); the Violence Against Women Reauthorization Act of 2013 (Public Law 113–4) (the 2013 Act); the Comprehensive Addiction and Recovery Act of 2016 (Public Law 114–198) (CARA); the Justice for All Reauthorization Act of 2016 (Public Law 114–324); Kevin and Avonte’s Law (division Q of Public Law 115–141) (Kevin and Avonte’s Law); the Keep Young Athletes Safe Act of 2018 (title III of division S of Public Law 115–141) (the Keep Young Athletes Safe Act); the STOP School Violence Act of 2018 (title V of division S of Public Law 115–141) (the STOP School Violence Act); the Fix NICS Act of 2018 (title VI of division S of Public Law 115–141); the Project Safe Neighborhoods Grant Program Authorization Act of 2018 (Public Law 115–185); and the SUPPORT for Patients and Communities Act (Public Law 115–271); and other programs.",
						"amount": 1723000000.0
					},
					{
						"id": "juvenile-justice-programs",
						"name": "Juvenile Justice Programs",
						"description": "For grants, contracts, cooperative agreements, and other assistance authorized by the Juvenile Justice and Delinquency Prevention Act of 1974 (the 1974 Act); the Omnibus Crime Control and Safe Streets Act of 1968 (the 1968 Act); the Violence Against Women and Department of Justice Reauthorization Act of 2005 (Public Law 109–162) (the 2005 Act); the Missing Children's Assistance Act (34 U.S.C. 11291 et seq.); the Prosecutorial Remedies and Other Tools to end the Exploitation of Children Today Act of 2003 (Public Law 108–21); the Victims of Child Abuse Act of 1990 (Public Law 101–647) (the 1990 Act); the Adam Walsh Child Protection and Safety Act of 2006 (Public Law 109–248) (the Adam Walsh Act); the PROTECT Our Children Act of 2008 (Public Law 110–401); the Violence Against Women Reauthorization Act of 2013 (Public Law 113–4) (the 2013 Act); the Justice for All Reauthorization Act of 2016 (Public Law 114–324); and other juvenile justice programs.",
						"amount": 287000000.0
					}
				]
			},
			{
				"id": "community-oriented-policing-services",
				"name": "Community Oriented Policing Services",
				"description": "For activities authorized by the Violent Crime Control and Law Enforcement Act of 1994 (Public Law 103–322); the Omnibus Crime Control and Safe Streets Act of 1968 (the 1968 Act); the Violence Against Women and Department of Justice Reauthorization Act of 2005 (Public Law 109–162) (the 2005 Act); and the SUPPORT for Patients and Communities Act (Public Law 115–271).",
				"amount": 303500000.0
			}
		]
	},
	{
		"id": "science-2",
		"name": "Science",
		"children": [
			{
				"id": "office-of-science-and-technology-policy",
				"name": "Office Of Science And Technology Policy",
				"description": "For necessary expenses of the Office of Science and Technology Policy, in carrying out the purposes of the National Science and Technology Policy, Organization, and Priorities Act of 1976 (42 U.S.C. 6601 et seq.), hire of passenger motor vehicles, and services as authorized by section 3109 of title 5, United States Code, not to exceed $2,250 for official reception and representation expenses, and rental of conference rooms in the District of Columbia.",
				"amount": 5544000.0
			},
			{
				"id": "national-space-council",
				"name": "National Space Council",
				"description": "For necessary expenses of the National Space Council, in carrying out the purposes of Title V of Public Law 100–685 and Executive Order 13803, hire of passenger motor vehicles, and services as authorized by section 3109 of title 5, United States Code, not to exceed $2,250 for official reception and representation expenses.",
				"amount": 1965000.0
			},
			{
				"id": "national-aeronautics-and-space-administration",
				"name": "National Aeronautics And Space Administration",
				"children": [
					{
						"id": "science-3",
						"name": "Science",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of science research and development activities, including research, development, operations, support, and services; maintenance and repair, facility planning and design; space flight, spacecraft control, and communications activities; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 6905700000.0
					},
					{
						"id": "aeronautics",
						"name": "Aeronautics",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of aeronautics research and development activities, including research, development, operations, support, and services; maintenance and repair, facility planning and design; space flight, spacecraft control, and communications activities; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 725000000.0
					},
					{
						"id": "space-technology",
						"name": "Space Technology",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of space technology research and development activities, including research, development, operations, support, and services; maintenance and repair, facility planning and design; space flight, spacecraft control, and communications activities; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 926900000.0
					},
					{
						"id": "exploration",
						"name": "Exploration",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of exploration research and development activities, including research, development, operations, support, and services; maintenance and repair, facility planning and design; space flight, spacecraft control, and communications activities; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 5050800000.0
					},
					{
						"id": "space-operations",
						"name": "Space Operations",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of space operations research and development activities, including research, development, operations, support and services; space flight, spacecraft control and communications activities, including operations, production, and services; maintenance and repair, facility planning and design; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance and operation of mission and administrative aircraft.",
						"amount": 4639100000.0
					},
					{
						"id": "science%2C-technology%2C-engineering%2C-and-mathematics-engagement",
						"name": "Science, Technology, Engineering, And Mathematics Engagement",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of aerospace and aeronautical education research and development activities, including research, development, operations, support, and services; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 110000000.0
					},
					{
						"id": "safety%2C-security-and-mission-services",
						"name": "Safety, Security And Mission Services",
						"description": "For necessary expenses, not otherwise provided for, in the conduct and support of science, aeronautics, space technology, exploration, space operations and education research and development activities, including research, development, operations, support, and services; maintenance and repair, facility planning and design; space flight, spacecraft control, and communications activities; program management; personnel and related costs, including uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; travel expenses; purchase and hire of passenger motor vehicles; not to exceed $63,000 for official reception and representation expenses; and purchase, lease, charter, maintenance, and operation of mission and administrative aircraft.",
						"amount": 2755000000.0
					},
					{
						"id": "construction-and-environmental-compliance-and-restoration",
						"name": "Construction And Environmental Compliance And Restoration",
						"description": "For necessary expenses for construction of facilities including repair, rehabilitation, revitalization, and modification of facilities, construction of new facilities and additions to existing facilities, facility planning and design, and restoration, and acquisition or condemnation of real property, as authorized by law, and environmental compliance and restoration.",
						"amount": 348200000.0
					},
					{
						"id": "office-of-inspector-general-12",
						"name": "Office Of Inspector General",
						"description": "For necessary expenses of the Office of Inspector General in carrying out the Inspector General Act of 1978.",
						"amount": 39300000.0
					}
				]
			},
			{
				"id": "national-science-foundation",
				"name": "National Science Foundation",
				"children": [
					{
						"id": "research-and-related-activities",
						"name": "Research And Related Activities",
						"description": "For necessary expenses in carrying out the National Science Foundation Act of 1950 (42 U.S.C. 1861 et seq.), and Public Law 86–209 (42 U.S.C. 1880 et seq.); services as authorized by section 3109 of title 5, United States Code; maintenance and operation of aircraft and purchase of flight services for research support; acquisition of aircraft; and authorized travel.",
						"amount": 6520000000.0
					},
					{
						"id": "major-research-equipment-and-facilities-construction",
						"name": "Major Research Equipment And Facilities Construction",
						"description": "For necessary expenses for the acquisition, construction, commissioning, and upgrading of major research equipment, facilities, and other such capital assets pursuant to the National Science Foundation Act of 1950 (42 U.S.C. 1861 et seq.), including authorized travel.",
						"amount": 295740000.0
					},
					{
						"id": "education-and-human-resources",
						"name": "Education And Human Resources",
						"description": "For necessary expenses in carrying out science, mathematics and engineering education and human resources programs and activities pursuant to the National Science Foundation Act of 1950 (42 U.S.C. 1861 et seq.), including services as authorized by section 3109 of title 5, United States Code, authorized travel, and rental of conference rooms in the District of Columbia.",
						"amount": 910000000.0
					},
					{
						"id": "agency-operations-and-award-management",
						"name": "Agency Operations And Award Management",
						"description": "For agency operations and award management necessary in carrying out the National Science Foundation Act of 1950 (42 U.S.C. 1861 et seq.); services authorized by section 3109 of title 5, United States Code; hire of passenger motor vehicles; uniforms or allowances therefor, as authorized by sections 5901 and 5902 of title 5, United States Code; rental of conference rooms in the District of Columbia; and reimbursement of the Department of Homeland Security for security guard services.",
						"amount": 329540000.0
					},
					{
						"id": "office-of-the-national-science-board",
						"name": "Office Of The National Science Board",
						"description": "For necessary expenses (including payment of salaries, authorized travel, hire of passenger motor vehicles, the rental of conference rooms in the District of Columbia, and the employment of experts and consultants under section 3109 of title 5, United States Code) involved in carrying out section 4 of the National Science Foundation Act of 1950 (42 U.S.C. 1863) and Public Law 86–209 (42 U.S.C. 1880 et seq.).",
						"amount": 4370000.0
					},
					{
						"id": "office-of-inspector-general-13",
						"name": "Office Of Inspector General",
						"description": "For necessary expenses of the Office of Inspector General as authorized by the Inspector General Act of 1978.",
						"amount": 15350000.0
					}
				]
			}
		]
	},
	{
		"id": "related-agencies-4",
		"name": "Related Agencies",
		"children": [
			{
				"id": "commission-on-civil-rights",
				"name": "Commission On Civil Rights",
				"description": "For necessary expenses of the Commission on Civil Rights, including hire of passenger motor vehicles.",
				"amount": 10065000.0
			},
			{
				"id": "equal-employment-opportunity-commission",
				"name": "Equal Employment Opportunity Commission",
				"description": "For necessary expenses of the Equal Employment Opportunity Commission as authorized by title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act of 1967, the Equal Pay Act of 1963, the Americans with Disabilities Act of 1990, section 501 of the Rehabilitation Act of 1973, the Civil Rights Act of 1991, the Genetic Information Nondiscrimination Act (GINA) of 2008 (Public Law 110–233), the ADA Amendments Act of 2008 (Public Law 110–325), and the Lilly Ledbetter Fair Pay Act of 2009 (Public Law 111–2), including services as authorized by section 3109 of title 5, United States Code; hire of passenger motor vehicles as authorized by section 1343(b) of title 31, United States Code; nonmonetary awards to private citizens; and up to $29,500,000 for payments to State and local enforcement agencies for authorized services to the Commission.",
				"amount": 379500000.0
			},
			{
				"id": "international-trade-commission",
				"name": "International Trade Commission",
				"description": "For necessary expenses of the International Trade Commission, including hire of passenger motor vehicles and services as authorized by section 3109 of title 5, United States Code, and not to exceed $2,250 for official reception and representation expenses.",
				"amount": 95000000.0
			},
			{
				"id": "legal-services-corporation",
				"name": "Legal Services Corporation",
				"description": "For payment to the Legal Services Corporation to carry out the purposes of the Legal Services Corporation Act of 1974.",
				"amount": 415000000.0
			},
			{
				"id": "marine-mammal-commission",
				"name": "Marine Mammal Commission",
				"description": "For necessary expenses of the Marine Mammal Commission as authorized by title II of the Marine Mammal Protection Act of 1972 (16 U.S.C. 1361 et seq.).",
				"amount": 3516000.0
			},
			{
				"id": "office-of-the-united-states-trade-representative",
				"name": "Office Of The United States Trade Representative",
				"children": [
					{
						"id": "salaries-and-expenses-19",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Office of the United States Trade Representative, including the hire of passenger motor vehicles and the employment of experts and consultants as authorized by section 3109 of title 5, United States Code.",
						"amount": 53000000.0
					},
					{
						"id": "trade-enforcement-trust-fund",
						"name": "Trade Enforcement Trust Fund",
						"description": "For activities of the United States Trade Representative authorized by section 611 of the Trade Facilitation and Trade Enforcement Act of 2015 (19 U.S.C. 4405), including transfers.",
						"amount": 15000000.0
					}
				]
			}
		]
	},
	{
		"id": "department-of-the-treasury",
		"name": "Department Of The Treasury",
		"children": [
			{
				"id": "departmental-offices",
				"name": "Departmental Offices",
				"children": [
					{
						"id": "salaries-and-expenses-20",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Departmental Offices including operation and maintenance of the Treasury Building and Freedman’s Bank Building; hire of passenger motor vehicles; maintenance, repairs, and improvements of, and purchase of commercial insurance policies for, real properties leased or owned overseas, when necessary for the performance of official business; executive direction program activities; international affairs and economic policy activities; domestic finance and tax policy activities, including technical assistance to Puerto Rico; and Treasury-wide management policies and programs activities.",
						"amount": 214576000.0
					},
					{
						"id": "salaries-and-expenses-21",
						"name": "Salaries And Expenses",
						"description": "For the necessary expenses of the Office of Terrorism and Financial Intelligence to safeguard the financial system against illicit use and to combat rogue nations, terrorist facilitators, weapons of mass destruction proliferators, money launderers, drug kingpins, and other national security threats.",
						"amount": 159000000.0
					},
					{
						"id": "cybersecurity-enhancement-account",
						"name": "Cybersecurity Enhancement Account",
						"description": "For salaries and expenses for enhanced cybersecurity for systems operated by the Department of the Treasury.",
						"amount": 25208000.0
					},
					{
						"id": "department-wide-systems-and-capital-investments-programs",
						"name": "Department-Wide Systems And Capital Investments Programs",
						"description": "For development and acquisition of automatic data processing equipment, software, and services and for repairs and renovations to buildings owned by the Department of the Treasury.",
						"amount": 4000000.0
					},
					{
						"id": "salaries-and-expenses-22",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978.",
						"amount": 37044000.0
					},
					{
						"id": "salaries-and-expenses-23",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Treasury Inspector General for Tax Administration in carrying out the Inspector General Act of 1978, as amended, including purchase and hire of passenger motor vehicles (31 U.S.C. 1343(b)); and services authorized by 5 U.S.C. 3109, at such rates as may be determined by the Inspector General for Tax Administration.",
						"amount": 170250000.0
					},
					{
						"id": "salaries-and-expenses-24",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Office of the Special Inspector General in carrying out the provisions of the Emergency Economic Stabilization Act of 2008 (Public Law 110–343).",
						"amount": 23000000.0
					}
				]
			},
			{
				"id": "financial-crimes-enforcement-network",
				"name": "Financial Crimes Enforcement Network",
				"description": "For necessary expenses of the Financial Crimes Enforcement Network, including hire of passenger motor vehicles; travel and training expenses of non-Federal and foreign government personnel to attend meetings and training concerned with domestic and foreign financial intelligence activities, law enforcement, and financial regulation; services authorized by 5 U.S.C. 3109; not to exceed $12,000 for official reception and representation expenses; and for assistance to Federal law enforcement agencies, with or without reimbursement.",
				"amount": 117800000.0
			},
			{
				"id": "bureau-of-the-fiscal-service",
				"name": "Bureau Of The Fiscal Service",
				"description": "For necessary expenses of operations of the Bureau of the Fiscal Service.",
				"amount": 338280000.0
			},
			{
				"id": "alcohol-and-tobacco-tax-and-trade-bureau",
				"name": "Alcohol And Tobacco Tax And Trade Bureau",
				"description": "For necessary expenses of carrying out section 1111 of the Homeland Security Act of 2002, including hire of passenger motor vehicles.",
				"amount": 119600000.0
			},
			{
				"id": "internal-revenue-service",
				"name": "Internal Revenue Service",
				"children": [
					{
						"id": "taxpayer-services",
						"name": "Taxpayer Services",
						"description": "For necessary expenses of the Internal Revenue Service to provide taxpayer services, including pre-filing assistance and education, filing and account services, taxpayer advocacy services, and other services as authorized by 5 U.S.C. 3109, at such rates as may be determined by the Commissioner.",
						"amount": 2491554000.0
					},
					{
						"id": "enforcement",
						"name": "Enforcement",
						"description": "For necessary expenses for tax enforcement activities of the Internal Revenue Service to determine and collect owed taxes, to provide legal and litigation support, to conduct criminal investigations, to enforce criminal statutes related to violations of internal revenue laws and other financial crimes, to purchase and hire passenger motor vehicles (31 U.S.C. 1343(b)), and to provide other services as authorized by 5 U.S.C. 3109, at such rates as may be determined by the Commissioner.",
						"amount": 4860000000.0
					},
					{
						"id": "operations-support",
						"name": "Operations Support",
						"description": "For necessary expenses of the Internal Revenue Service to support taxpayer services and enforcement programs, including rent payments; facilities services; printing; postage; physical security; headquarters and other IRS-wide administration activities; research and statistics of income; telecommunications; information technology development, enhancement, operations, maintenance, and security; the hire of passenger motor vehicles (31 U.S.C. 1343(b)); the operations of the Internal Revenue Service Oversight Board; and other services as authorized by 5 U.S.C. 3109, at such rates as may be determined by the Commissioner.",
						"amount": 3724000000.0
					},
					{
						"id": "business-systems-modernization",
						"name": "Business Systems Modernization",
						"description": "For necessary expenses of the Internal Revenue Service's business systems modernization program.",
						"amount": 150000000.0
					}
				]
			}
		]
	},
	{
		"id": "executive-office-of-the-president-and-funds-appropriated-to-the-president",
		"name": "Executive Office Of The President And Funds Appropriated To The President",
		"children": [
			{
				"id": "the-white-house",
				"name": "The White House",
				"description": "For necessary expenses for the White House as authorized by law, including not to exceed $3,850,000 for services as authorized by 5 U.S.C. 3109 and 3 U.S.C. 105; subsistence expenses as authorized by 3 U.S.C. 105, which shall be expended and accounted for as provided in that section; hire of passenger motor vehicles, and travel (not to exceed $100,000 to be expended and accounted for as provided by 3 U.S.C. 103); and not to exceed $19,000 for official reception and representation expenses, to be available for allocation within the Executive Office of the President; and for necessary expenses of the Office of Policy Development, including services as authorized by 5 U.S.C. 3109 and 3 U.S.C. 107.",
				"amount": 55000000.0
			},
			{
				"id": "executive-residence-at-the-white-house",
				"name": "Executive Residence At The White House",
				"description": "For necessary expenses of the Executive Residence at the White House.",
				"amount": 13081000.0
			},
			{
				"id": "white-house-repair-and-restoration",
				"name": "White House Repair And Restoration",
				"description": "For the repair, alteration, and improvement of the Executive Residence at the White House pursuant to 3 U.S.C. 105(d).",
				"amount": 750000.0
			},
			{
				"id": "council-of-economic-advisers",
				"name": "Council Of Economic Advisers",
				"description": "For necessary expenses of the Council of Economic Advisers in carrying out its functions under the Employment Act of 1946 (15 U.S.C. 1021 et seq.).",
				"amount": 4187000.0
			},
			{
				"id": "national-security-council-and-homeland-security-council",
				"name": "National Security Council And Homeland Security Council",
				"description": "For necessary expenses of the National Security Council and the Homeland Security Council, including services as authorized by 5 U.S.C. 3109.",
				"amount": 12000000.0
			},
			{
				"id": "office-of-administration",
				"name": "Office Of Administration",
				"description": "For necessary expenses of the Office of Administration, including services as authorized by 5 U.S.C. 3109 and 3 U.S.C. 107, and hire of passenger motor vehicles.",
				"amount": 100000000.0
			},
			{
				"id": "office-of-management-and-budget",
				"name": "Office Of Management And Budget",
				"description": "For necessary expenses of the Office of Management and Budget, including hire of passenger motor vehicles and services as authorized by 5 U.S.C. 3109, to carry out the provisions of chapter 35 of title 44, United States Code, and to prepare and submit the budget of the United States Government, in accordance with section 1105(a) of title 31, United States Code.",
				"amount": 102000000.0
			},
			{
				"id": "office-of-national-drug-control-policy",
				"name": "Office Of National Drug Control Policy",
				"children": [
					{
						"id": "salaries-and-expenses-25",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Office of National Drug Control Policy; for research activities pursuant to the Office of National Drug Control Policy Reauthorization Act of 2006 (Public Law 109–469); not to exceed $10,000 for official reception and representation expenses; and for participation in joint projects or in the provision of services on matters of mutual interest with nonprofit, research, or public organizations or agencies, with or without reimbursement.",
						"amount": 18400000.0
					},
					{
						"id": "high-intensity-drug-trafficking-areas-program",
						"name": "High Intensity Drug Trafficking Areas Program",
						"description": "For necessary expenses of the Office of National Drug Control Policy's High Intensity Drug Trafficking Areas Program.",
						"amount": 280000000.0
					},
					{
						"id": "other-federal-drug-control-programs",
						"name": "Other Federal Drug Control Programs",
						"description": "For other drug control activities authorized by the Office of National Drug Control Policy Reauthorization Act of 2006 (Public Law 109–469).",
						"amount": 118327000.0
					}
				]
			},
			{
				"id": "unanticipated-needs",
				"name": "Unanticipated Needs",
				"description": "For expenses necessary to enable the President to meet unanticipated needs, in furtherance of the national interest, security, or defense which may arise at home or abroad during the current fiscal year, as authorized by 3 U.S.C. 108.",
				"amount": 1000000.0
			},
			{
				"id": "information-technology-oversight-and-reform",
				"name": "Information Technology Oversight And Reform",
				"description": "For necessary expenses for the furtherance of integrated, efficient, secure, and effective uses of information technology in the Federal Government.",
				"amount": 28500000.0
			},
			{
				"id": "special-assistance-to-the-president",
				"name": "Special Assistance To The President",
				"description": "For necessary expenses to enable the Vice President to provide assistance to the President in connection with specially assigned functions; services as authorized by 5 U.S.C. 3109 and 3 U.S.C. 106, including subsistence expenses as authorized by 3 U.S.C. 106, which shall be expended and accounted for as provided in that section; and hire of passenger motor vehicles.",
				"amount": 4288000.0
			},
			{
				"id": "official-residence-of-the-vice-president",
				"name": "Official Residence Of The Vice President",
				"description": "For the care, operation, refurnishing, improvement, and to the extent not otherwise provided for, heating and lighting, including electric power and fixtures, of the official residence of the Vice President; the hire of passenger motor vehicles; and not to exceed $90,000 pursuant to 3 U.S.C. 106(b)(2).",
				"amount": 302000.0
			}
		]
	},
	{
		"id": "the-judiciary",
		"name": "The Judiciary",
		"children": [
			{
				"id": "supreme-court-of-the-united-states",
				"name": "Supreme Court Of The United States",
				"children": [
					{
						"id": "salaries-and-expenses-26",
						"name": "Salaries And Expenses",
						"description": "For expenses necessary for the operation of the Supreme Court, as required by law, excluding care of the building and grounds, including hire of passenger motor vehicles as authorized by 31 U.S.C. 1343 and 1344; not to exceed $10,000 for official reception and representation expenses; and for miscellaneous expenses, to be expended as the Chief Justice may approve.",
						"amount": 84703000.0
					},
					{
						"id": "care-of-the-building-and-grounds",
						"name": "Care Of The Building And Grounds",
						"description": "For such expenditures as may be necessary to enable the Architect of the Capitol to carry out the duties imposed upon the Architect by 40 U.S.C. 6111 and 6112.",
						"amount": 15999000.0
					}
				]
			},
			{
				"id": "united-states-court-of-appeals-for-the-federal-circuit",
				"name": "United States Court Of Appeals For The Federal Circuit",
				"description": "For salaries of officers and employees, and for necessary expenses of the court, as authorized by law.",
				"amount": 32016000.0
			},
			{
				"id": "courts-of-appeals%2C-district-courts%2C-and-other-judicial-services",
				"name": "Courts Of Appeals, District Courts, And Other Judicial Services",
				"children": [
					{
						"id": "salaries-and-expenses-27",
						"name": "Salaries And Expenses",
						"description": "For the salaries of judges of the United States Court of Federal Claims, magistrate judges, and all other officers and employees of the Federal Judiciary not otherwise specifically provided for, necessary expenses of the courts, and the purchase, rental, repair, and cleaning of uniforms for Probation and Pretrial Services Office staff, as authorized by law.",
						"amount": 5144383000.0
					},
					{
						"id": "defender-services",
						"name": "Defender Services",
						"description": "For the operation of Federal Defender organizations; the compensation and reimbursement of expenses of attorneys appointed to represent persons under 18 U.S.C. 3006A and 3599, and for the compensation and reimbursement of expenses of persons furnishing investigative, expert, and other services for such representations as authorized by law; the compensation (in accordance with the maximums under 18 U.S.C. 3006A) and reimbursement of expenses of attorneys appointed to assist the court in criminal cases where the defendant has waived representation by counsel; the compensation and reimbursement of expenses of attorneys appointed to represent jurors in civil actions for the protection of their employment, as authorized by 28 U.S.C. 1875(d)(1); the compensation and reimbursement of expenses of attorneys appointed under 18 U.S.C. 983(b)(1) in connection with certain judicial civil forfeiture proceedings; the compensation and reimbursement of travel expenses of guardians ad litem appointed under 18 U.S.C. 4100(b); and for necessary training and general administrative expenses.",
						"amount": 1150450000.0
					},
					{
						"id": "fees-of-jurors-and-commissioners",
						"name": "Fees Of Jurors And Commissioners",
						"description": "For fees and expenses of jurors as authorized by 28 U.S.C. 1871 and 1876; compensation of jury commissioners as authorized by 28 U.S.C. 1863; and compensation of commissioners appointed in condemnation cases pursuant to rule 71.1(h) of the Federal Rules of Civil Procedure (28 U.S.C. Appendix Rule 71.1(h)).",
						"amount": 49750000.0
					},
					{
						"id": "court-security",
						"name": "Court Security",
						"description": "For necessary expenses, not otherwise provided for, incident to the provision of protective guard services for United States courthouses and other facilities housing Federal court operations, and the procurement, installation, and maintenance of security systems and equipment for United States courthouses and other facilities housing Federal court operations, including building ingress-egress control, inspection of mail and packages, directed security patrols, perimeter security, basic security services provided by the Federal Protective Service, and other similar activities as authorized by section 1010 of the Judicial Improvement and Access to Justice Act (Public Law 100–702).",
						"amount": 607110000.0
					}
				]
			},
			{
				"id": "administrative-office-of-the-united-states-courts",
				"name": "Administrative Office Of The United States Courts",
				"description": "For necessary expenses of the Administrative Office of the United States Courts as authorized by law, including travel as authorized by 31 U.S.C. 1345, hire of a passenger motor vehicle as authorized by 31 U.S.C. 1343(b), advertising and rent in the District of Columbia and elsewhere.",
				"amount": 92413000.0
			},
			{
				"id": "federal-judicial-center",
				"name": "Federal Judicial Center",
				"description": "For necessary expenses of the Federal Judicial Center, as authorized by Public Law 90–219.",
				"amount": 29819000.0
			},
			{
				"id": "united-states-sentencing-commission",
				"name": "United States Sentencing Commission",
				"description": "For the salaries and expenses necessary to carry out the provisions of chapter 58 of title 28, United States Code.",
				"amount": 18953000.0
			}
		]
	},
	{
		"id": "district-of-columbia",
		"name": "District Of Columbia",
		"children": [
			{
				"id": "federal-payment-for-resident-tuition-support",
				"name": "Federal Payment For Resident Tuition Support",
				"description": "For a Federal payment to the District of Columbia, to be deposited into a dedicated account, for a nationwide program to be administered by the Mayor, for District of Columbia resident tuition support.",
				"amount": 40000000.0
			},
			{
				"id": "federal-payment-for-emergency-planning-and-security-costs-in-the-district-of-columbia",
				"name": "Federal Payment For Emergency Planning And Security Costs In The District Of Columbia",
				"description": "For a Federal payment of necessary expenses, as determined by the Mayor of the District of Columbia in written consultation with the elected county or city officials of surrounding jurisdictions.",
				"amount": 12000000.0
			},
			{
				"id": "federal-payment-to-the-district-of-columbia-courts",
				"name": "Federal Payment To The District Of Columbia Courts",
				"description": "For salaries and expenses for the District of Columbia Courts.",
				"amount": 258394000.0
			},
			{
				"id": "federal-payment-for-defender-services-in-district-of-columbia-courts",
				"name": "Federal Payment For Defender Services In District Of Columbia Courts",
				"description": "For payments authorized under section 11–2604 and section 11–2605, D.C. Official Code (relating to representation provided under the District of Columbia Criminal Justice Act), payments for counsel appointed in proceedings in the Family Court of the Superior Court of the District of Columbia under chapter 23 of title 16, D.C. Official Code, or pursuant to contractual agreements to provide guardian ad litem representation, training, technical assistance, and such other services as are necessary to improve the quality of guardian ad litem representation, payments for counsel appointed in adoption proceedings under chapter 3 of title 16, D.C. Official Code, and payments authorized under section 21–2060, D.C. Official Code (relating to services provided under the District of Columbia Guardianship, Protective Proceedings, and Durable Power of Attorney Act of 1986).",
				"amount": 46005000.0
			},
			{
				"id": "federal-payment-to-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia",
				"name": "Federal Payment To The Court Services And Offender Supervision Agency For The District Of Columbia ",
				"description": "For salaries and expenses, including the transfer and hire of motor vehicles, of the Court Services and Offender Supervision Agency for the District of Columbia, as authorized by the National Capital Revitalization and Self-Government Improvement Act of 1997.",
				"amount": 256724000.0
			},
			{
				"id": "federal-payment-to-the-district-of-columbia-public-defender-service",
				"name": "Federal Payment To The District Of Columbia Public Defender Service",
				"description": "For salaries and expenses, including the transfer and hire of motor vehicles, of the District of Columbia Public Defender Service, as authorized by the National Capital Revitalization and Self-Government Improvement Act of 1997.",
				"amount": 45858000.0
			},
			{
				"id": "federal-payment-to-the-criminal-justice-coordinating-council",
				"name": "Federal Payment To The Criminal Justice Coordinating Council",
				"description": "For a Federal payment to the Criminal Justice Coordinating Council.",
				"amount": 2150000.0
			},
			{
				"id": "federal-payment-for-judicial-commissions",
				"name": "Federal Payment For Judicial Commissions",
				"description": "For a Federal payment, to remain available until September 30, 2020, to the Commission on Judicial Disabilities and Tenure.",
				"amount": 295000.0
			},
			{
				"id": "federal-payment-for-school-improvement",
				"name": "Federal Payment For School Improvement",
				"description": "For a Federal payment for a school improvement program in the District of Columbia.",
				"amount": 52500000.0
			},
			{
				"id": "federal-payment-for-the-district-of-columbia-national-guard",
				"name": "Federal Payment For The District Of Columbia National Guard",
				"description": "For a Federal payment to the District of Columbia National Guard.",
				"amount": 435000.0
			},
			{
				"id": "federal-payment-for-testing-and-treatment-of-hiv%2Faids",
				"name": "Federal Payment For Testing And Treatment Of Hiv/Aids",
				"description": "For a Federal payment to the District of Columbia for the testing of individuals for, and the treatment of individuals with, human immunodeficiency virus and acquired immunodeficiency syndrome in the District of Columbia.",
				"amount": 3000000.0
			}
		]
	},
	{
		"id": "independent-agencies-2",
		"name": "Independent Agencies",
		"children": [
			{
				"id": "administrative-conference-of-the-united-states",
				"name": "Administrative Conference Of The United States",
				"description": "For necessary expenses of the Administrative Conference of the United States, authorized by 5 U.S.C. 591 et seq..",
				"amount": 3100000.0
			},
			{
				"id": "commodity-futures-trading-commission",
				"name": "Commodity Futures Trading Commission",
				"description": "For necessary expenses to carry out the provisions of the Commodity Exchange Act (7 U.S.C. 1 et seq.), including the purchase and hire of passenger motor vehicles, and the rental of space (to include multiple year leases), in the District of Columbia and elsewhere.",
				"amount": 268000000.0
			},
			{
				"id": "consumer-product-safety-commission",
				"name": "Consumer Product Safety Commission",
				"description": "For necessary expenses of the Consumer Product Safety Commission, including hire of passenger motor vehicles, services as authorized by 5 U.S.C. 3109, but at rates for individuals not to exceed the per diem rate equivalent to the maximum rate payable under 5 U.S.C. 5376, purchase of nominal awards to recognize non-Federal officials' contributions to Commission activities, and not to exceed $4,000 for official reception and representation expenses.",
				"amount": 127000000.0
			},
			{
				"id": "election-assistance-commission",
				"name": "Election Assistance Commission",
				"description": "For necessary expenses to carry out the Help America Vote Act of 2002 (Public Law 107–252).",
				"amount": 9200000.0
			},
			{
				"id": "federal-communications-commission",
				"name": "Federal Communications Commission",
				"children": [
					{
						"id": "salaries-and-expenses-28",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Federal Communications Commission, as authorized by law, including uniforms and allowances therefor, as authorized by 5 U.S.C. 5901–5902; not to exceed $4,000 for official reception and representation expenses; purchase and hire of motor vehicles; special counsel fees; and services as authorized by 5 U.S.C. 3109.",
						"amount": 339000000.0
					},
					{
						"id": "administrative-provision%E2%80%94federal-communications-commission",
						"name": "Administrative Provision—Federal Communications Commission",
						"children": [
							{
								"id": null,
								"name": null,
								"description": "None of the funds appropriated by this Act may be used by the Federal Communications Commission to modify, amend, or change its rules or regulations for universal service support payments to implement the February 27, 2004 recommendations of the Federal-State Joint Board on Universal Service regarding single connection or primary line restrictions on universal service support payments.",
								"children": [
									{
										"id": "federal-deposit-insurance-corporation",
										"name": "Federal Deposit Insurance Corporation",
										"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978.",
										"amount": 42982000.0
									},
									{
										"id": "federal-election-commission",
										"name": "Federal Election Commission",
										"description": "For necessary expenses to carry out the provisions of the Federal Election Campaign Act of 1971.",
										"amount": 71250000.0
									},
									{
										"id": "federal-labor-relations-authority",
										"name": "Federal Labor Relations Authority",
										"description": "For necessary expenses to carry out functions of the Federal Labor Relations Authority, pursuant to Reorganization Plan Numbered 2 of 1978, and the Civil Service Reform Act of 1978, including services authorized by 5 U.S.C. 3109, and including hire of experts and consultants, hire of passenger motor vehicles, and including official reception and representation expenses (not to exceed $1,500) and rental of conference rooms in the District of Columbia and elsewhere.",
										"amount": 26200000.0
									},
									{
										"id": "federal-trade-commission",
										"name": "Federal Trade Commission",
										"description": "For necessary expenses of the Federal Trade Commission, including uniforms or allowances therefor, as authorized by 5 U.S.C. 5901–5902; services as authorized by 5 U.S.C. 3109; hire of passenger motor vehicles; and not to exceed $2,000 for official reception and representation expenses.",
										"amount": 309700000.0
									},
									{
										"id": "general-services-administration",
										"name": "General Services Administration",
										"children": [
											{
												"id": "government-wide-policy",
												"name": "Government-Wide Policy",
												"description": "For expenses authorized by law, not otherwise provided for, for Government-wide policy and evaluation activities associated with the management of real and personal property assets and certain administrative services; Government-wide policy support responsibilities relating to acquisition, travel, motor vehicles, information technology management, and related technology activities; and services as authorized by 5 U.S.C. 3109.",
												"amount": 60000000.0
											},
											{
												"id": "operating-expenses-2",
												"name": "Operating Expenses",
												"description": "For expenses authorized by law, not otherwise provided for, for Government-wide activities associated with utilization and donation of surplus personal property; disposal of real property; agency-wide policy direction, management, and communications; and services as authorized by 5 U.S.C. 3109.",
												"amount": 49440000.0
											},
											{
												"id": "civilian-board-of-contract-appeals",
												"name": "Civilian Board Of Contract Appeals",
												"description": "For expenses authorized by law, not otherwise provided for, for the activities associated with the Civilian Board of Contract Appeals.",
												"amount": 9301000.0
											},
											{
												"id": "office-of-inspector-general-14",
												"name": "Office Of Inspector General",
												"description": "For necessary expenses of the Office of Inspector General and service authorized by 5 U.S.C. 3109.",
												"amount": 65000000.0
											},
											{
												"id": "allowances-and-office-staff-for-former-presidents",
												"name": "Allowances And Office Staff For Former Presidents",
												"description": "For carrying out the provisions of the Act of August 25, 1958 (3 U.S.C. 102 note), and Public Law 95–138.",
												"amount": 4796000.0
											},
											{
												"id": "%28including-transfer-of-funds%29",
												"name": " (Including Transfer Of Funds) ",
												"description": "For necessary expenses of the Office of Products and Programs, including services authorized by 40 U.S.C. 323 and 44 U.S.C. 3604; and for necessary expenses in support of interagency projects that enable the Federal Government to enhance its ability to conduct activities electronically, through the development and implementation of innovative uses of information technology.",
												"amount": 55000000.0
											},
											{
												"id": "technology-modernization-fund",
												"name": "Technology Modernization Fund",
												"description": "For the Technology Modernization Fund.",
												"amount": 25000000.0
											},
											{
												"id": "asset-proceeds-and-space-management-fund",
												"name": "Asset Proceeds And Space Management Fund",
												"description": "For carrying out the purposes of the Federal Assets Sale and Transfer Act of 2016 (Public Law 114–287).",
												"amount": 25000000.0
											},
											{
												"id": "environmental-review-improvement-fund",
												"name": "Environmental Review Improvement Fund",
												"description": "For necessary expenses of the Environmental Review Improvement Fund established pursuant to 42 U.S.C. 4370m–8(d).",
												"amount": 6070000.0
											}
										]
									}
								]
							},
							{
								"id": null,
								"name": null,
								"description": "The Administrator of General Services shall submit a report to the Committees on Appropriations of the Senate and House of Representatives not later than 30 days following implementation of the initiative established under (c)(2) of Section 846 of the National Defense Authorization Act for Fiscal Year 2018 (Public Law 115–91; 41 U.S.C. 1901 note) containing a market analysis and an implementation strategy related to the requirements under subparagraph (h) of Section 846. The report shall address strategies and processes for proper government safeguards to data management and privacy for incorporation into the implementation of Section 846 to ensure a competitive environment.",
								"children": [
									{
										"id": "harry-s-truman-scholarship-foundation",
										"name": "Harry S Truman Scholarship Foundation",
										"description": "For payment to the Harry S Truman Scholarship Foundation Trust Fund, established by section 10 of Public Law 93–642.",
										"amount": 1000000.0
									},
									{
										"id": "merit-systems-protection-board",
										"name": "Merit Systems Protection Board",
										"description": "For necessary expenses to carry out functions of the Merit Systems Protection Board pursuant to Reorganization Plan Numbered 2 of 1978, the Civil Service Reform Act of 1978, and the Whistleblower Protection Act of 1989 (5 U.S.C. 5509 note), including services as authorized by 5 U.S.C. 3109, rental of conference rooms in the District of Columbia and elsewhere, hire of passenger motor vehicles, direct procurement of survey printing, and not to exceed $2,000 for official reception and representation expenses.",
										"amount": 44490000.0
									},
									{
										"id": "morris-k.-udall-and-stewart-l.-udall-foundation",
										"name": "Morris K. Udall And Stewart L. Udall Foundation",
										"children": [
											{
												"id": "morris-k.-udall-and-stewart-l.-udall-trust-fund",
												"name": "Morris K. Udall And Stewart L. Udall Trust Fund",
												"description": "For payment to the Morris K. Udall and Stewart L. Udall Trust Fund, pursuant to the Morris K. Udall and Stewart L. Udall Foundation Act (20 U.S.C. 5601 et seq.).",
												"amount": 1875000.0
											},
											{
												"id": "environmental-dispute-resolution-fund",
												"name": "Environmental Dispute Resolution Fund",
												"description": "For payment to the Environmental Dispute Resolution Fund to carry out activities authorized in the Environmental Policy and Conflict Resolution Act of 1998.",
												"amount": 3200000.0
											}
										]
									},
									{
										"id": "national-archives-and-records-administration",
										"name": "National Archives And Records Administration",
										"children": [
											{
												"id": "operating-expenses-3",
												"name": "Operating Expenses",
												"description": "For necessary expenses in connection with the administration of the National Archives and Records Administration and archived Federal records and related activities, as provided by law, and for expenses necessary for the review and declassification of documents, the activities of the Public Interest Declassification Board, the operations and maintenance of the electronic records archives, the hire of passenger motor vehicles, and for uniforms or allowances therefor, as authorized by law (5 U.S.C. 5901), including maintenance, repairs, and cleaning.",
												"amount": 373000000.0
											},
											{
												"id": "office-of-inspector-general-15",
												"name": "Office Of Inspector General",
												"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Reform Act of 2008, Public Law 110–409, 122 Stat. 4302–16 (2008), and the Inspector General Act of 1978 (5 U.S.C. App.), and for the hire of passenger motor vehicles.",
												"amount": 4823000.0
											},
											{
												"id": "repairs-and-restoration",
												"name": "Repairs And Restoration",
												"description": "For the repair, alteration, and improvement of archives facilities, and to provide adequate storage for holdings.",
												"amount": 7500000.0
											},
											{
												"id": "grants-program",
												"name": "Grants Program",
												"description": "For necessary expenses for allocations and grants for historical publications and records as authorized by 44 U.S.C. 2504.",
												"amount": 6000000.0
											}
										]
									},
									{
										"id": "national-credit-union-administration",
										"name": "National Credit Union Administration",
										"description": "For the Community Development Revolving Loan Fund program as authorized by 42 U.S.C. 9812, 9822 and 9910.",
										"amount": 2000000.0
									},
									{
										"id": "office-of-government-ethics",
										"name": "Office Of Government Ethics",
										"description": "For necessary expenses to carry out functions of the Office of Government Ethics pursuant to the Ethics in Government Act of 1978, the Ethics Reform Act of 1989, and the Stop Trading on Congressional Knowledge Act of 2012, including services as authorized by 5 U.S.C. 3109, rental of conference rooms in the District of Columbia and elsewhere, hire of passenger motor vehicles, and not to exceed $1,500 for official reception and representation expenses.",
										"amount": 17019000.0
									},
									{
										"id": "office-of-personnel-management",
										"name": "Office Of Personnel Management",
										"children": [
											{
												"id": "salaries-and-expenses-29",
												"name": "Salaries And Expenses",
												"description": "For necessary expenses to carry out functions of the Office of Personnel Management (OPM) pursuant to Reorganization Plan Numbered 2 of 1978 and the Civil Service Reform Act of 1978, including services as authorized by 5 U.S.C. 3109; medical examinations performed for veterans by private physicians on a fee basis; rental of conference rooms in the District of Columbia and elsewhere; hire of passenger motor vehicles; not to exceed $2,500 for official reception and representation expenses; advances for reimbursements to applicable funds of OPM and the Federal Bureau of Investigation for expenses incurred under Executive Order No. 10422 of January 9, 1953, as amended; and payment of per diem and/or subsistence allowances to employees where Voting Rights Act activities require an employee to remain overnight at his or her post of duty.",
												"amount": 132172000.0
											},
											{
												"id": "salaries-and-expenses-30",
												"name": "Salaries And Expenses",
												"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978, including services as authorized by 5 U.S.C. 3109, hire of passenger motor vehicles.",
												"amount": 5000000.0
											}
										]
									},
									{
										"id": "office-of-special-counsel",
										"name": "Office Of Special Counsel",
										"description": "For necessary expenses to carry out functions of the Office of Special Counsel pursuant to Reorganization Plan Numbered 2 of 1978, the Civil Service Reform Act of 1978 (Public Law 95–454), the Whistleblower Protection Act of 1989 (Public Law 101–12) as amended by Public Law 107–304, the Whistleblower Protection Enhancement Act of 2012 (Public Law 112–199), and the Uniformed Services Employment and Reemployment Rights Act of 1994 (Public Law 103–353), including services as authorized by 5 U.S.C. 3109, payment of fees and expenses for witnesses, rental of conference rooms in the District of Columbia and elsewhere, and hire of passenger motor vehicles.",
										"amount": 26535000.0
									},
									{
										"id": "postal-regulatory-commission",
										"name": "Postal Regulatory Commission",
										"description": "For necessary expenses of the Postal Regulatory Commission in carrying out the provisions of the Postal Accountability and Enhancement Act (Public Law 109–435).",
										"amount": 15200000.0
									},
									{
										"id": "privacy-and-civil-liberties-oversight-board",
										"name": "Privacy And Civil Liberties Oversight Board",
										"description": "For necessary expenses of the Privacy and Civil Liberties Oversight Board, as authorized by section 1061 of the Intelligence Reform and Terrorism Prevention Act of 2004 (42 U.S.C. 2000ee).",
										"amount": 5000000.0
									},
									{
										"id": "securities-and-exchange-commission",
										"name": "Securities And Exchange Commission",
										"description": "For necessary expenses for the Securities and Exchange Commission, including services as authorized by 5 U.S.C. 3109, the rental of space (to include multiple year leases) in the District of Columbia and elsewhere, and not to exceed $3,500 for official reception and representation expenses.",
										"amount": 1674902000.0
									},
									{
										"id": "selective-service-system",
										"name": "Selective Service System",
										"description": "For necessary expenses of the Selective Service System, including expenses of attendance at meetings and of training for uniformed personnel assigned to the Selective Service System, as authorized by 5 U.S.C. 4101–4118 for civilian employees; hire of passenger motor vehicles; services as authorized by 5 U.S.C. 3109; and not to exceed $750 for official reception and representation expenses.",
										"amount": 26000000.0
									},
									{
										"id": "small-business-administration",
										"name": "Small Business Administration",
										"children": [
											{
												"id": "salaries-and-expenses-31",
												"name": "Salaries And Expenses",
												"description": "For necessary expenses, not otherwise provided for, of the Small Business Administration, including hire of passenger motor vehicles as authorized by sections 1343 and 1344 of title 31, United States Code, and not to exceed $3,500 for official reception and representation expenses.",
												"amount": 267500000.0
											},
											{
												"id": "entrepreneurial-development-programs",
												"name": "Entrepreneurial Development Programs",
												"description": "For necessary expenses of programs supporting entrepreneurial and small business development.",
												"amount": 247700000.0
											},
											{
												"id": "office-of-inspector-general-16",
												"name": "Office Of Inspector General",
												"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978.",
												"amount": 21900000.0
											},
											{
												"id": "office-of-advocacy",
												"name": "Office Of Advocacy",
												"description": "For necessary expenses of the Office of Advocacy in carrying out the provisions of title II of Public Law 94–305 (15 U.S.C. 634a et seq.) and the Regulatory Flexibility Act of 1980 (5 U.S.C. 601 et seq.).",
												"amount": 9120000.0
											},
											{
												"id": "business-loans-program-account",
												"name": "Business Loans Program Account",
												"description": "For the cost of direct loans.",
												"amount": 4000000.0
											},
											{
												"id": "disaster-loans-program-account",
												"name": "Disaster Loans Program Account",
												"description": "For administrative expenses to carry out the direct loan program authorized by section 7(b) of the Small Business Act.",
												"amount": 10000000.0
											}
										]
									}
								]
							},
							{
								"id": null,
								"name": null,
								"description": "Not to exceed 3 percent of any appropriation made available in this Act for the Small Business Administration under the headings Salaries and Expenses and Business Loans Program Account may be transferred to the Administration's information technology system modernization and working capital fund (IT WCF), as authorized by section 1077(b)(1) of title X of division A of the National Defense Authorization Act for Fiscal Year 2018, for the purposes specified in section 1077(b)(3) of such Act, upon the advance approval of the Committees on Appropriations of the House of Representatives and the Senate: Provided, That amounts transferred to the IT WCF under this section shall remain available for obligation through September 30, 2022.",
								"children": [
									{
										"id": "united-states-postal-service",
										"name": "United States Postal Service",
										"children": [
											{
												"id": "payment-to-the-postal-service-fund",
												"name": "Payment To The Postal Service Fund",
												"description": "For payment to the Postal Service Fund for revenue forgone on free and reduced rate mail, pursuant to subsections (c) and (d) of section 2401 of title 39, United States Code.",
												"amount": 55235000.0
											},
											{
												"id": "salaries-and-expenses-32",
												"name": "Salaries And Expenses",
												"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978.",
												"amount": 250000000.0
											}
										]
									},
									{
										"id": "united-states-tax-court",
										"name": "United States Tax Court",
										"description": "For necessary expenses, including contract reporting and other services as authorized by 5 U.S.C. 3109.",
										"amount": 51515000.0
									}
								]
							}
						]
					}
				]
			}
		]
	},
	{
		"id": "department-of-the-interior-2",
		"name": "Department Of The Interior",
		"children": [
			{
				"id": "bureau-of-land-management",
				"name": "Bureau Of Land Management",
				"children": [
					{
						"id": "management-of-lands-and-resources",
						"name": "Management Of Lands And Resources",
						"description": "For necessary expenses for protection, use, improvement, development, disposal, cadastral surveying, classification, acquisition of easements and other interests in lands, and performance of other functions, including maintenance of facilities, as authorized by law, in the management of lands and their resources under the jurisdiction of the Bureau of Land Management, including the general administration of the Bureau, and assessment of mineral potential of public lands pursuant to section 1010(a) of Public Law 96–487 (16 U.S.C. 3150(a)).",
						"amount": 1198000000.0
					},
					{
						"id": "land-acquisition",
						"name": "Land Acquisition",
						"description": "For expenses necessary to carry out sections 205, 206, and 318(d) of Public Law 94–579, including administrative expenses and acquisition of lands or waters, or interests therein.",
						"amount": 28316000.0
					},
					{
						"id": "oregon-and-california-grant-lands",
						"name": "Oregon And California Grant Lands",
						"description": "For expenses necessary for management, protection, and development of resources and for construction, operation, and maintenance of access roads, reforestation, and other improvements on the revested Oregon and California Railroad grant lands, on other Federal lands in the Oregon and California land-grant counties of Oregon, and on adjacent rights-of-way; and acquisition of lands or interests therein, including existing connecting roads on or adjacent to such grant lands.",
						"amount": 106985000.0
					}
				]
			},
			{
				"id": "united-states-fish-and-wildlife-service",
				"name": "United States Fish And Wildlife Service",
				"children": [
					{
						"id": "resource-management",
						"name": "Resource Management",
						"description": "For necessary expenses of the United States Fish and Wildlife Service, as authorized by law, and for scientific and economic studies, general administration, and for the performance of other authorized functions related to such resources.",
						"amount": 1292078000.0
					},
					{
						"id": "construction-5",
						"name": "Construction",
						"description": "For construction, improvement, acquisition, or removal of buildings and other facilities required in the conservation, management, investigation, protection, and utilization of fish and wildlife resources, and the acquisition of lands and interests therein.",
						"amount": 55613000.0
					},
					{
						"id": "land-acquisition-2",
						"name": "Land Acquisition",
						"description": "For expenses necessary to carry out chapter 2003 of title 54, United States Code, including administrative expenses, and for acquisition of land or waters, or interest therein, in accordance with statutory authority applicable to the United States Fish and Wildlife Service.",
						"amount": 65189000.0
					},
					{
						"id": "cooperative-endangered-species-conservation-fund",
						"name": "Cooperative Endangered Species Conservation Fund",
						"description": "For expenses necessary to carry out section 6 of the Endangered Species Act of 1973 (16 U.S.C. 1535).",
						"amount": 53495000.0
					},
					{
						"id": "national-wildlife-refuge-fund",
						"name": "National Wildlife Refuge Fund",
						"description": "For expenses necessary to implement the Act of October 17, 1978 (16 U.S.C. 715s).",
						"amount": 13228000.0
					},
					{
						"id": "north-american-wetlands-conservation-fund",
						"name": "North American Wetlands Conservation Fund",
						"description": "For expenses necessary to carry out the provisions of the North American Wetlands Conservation Act (16 U.S.C. 4401 et seq.).",
						"amount": 42000000.0
					},
					{
						"id": "neotropical-migratory-bird-conservation",
						"name": "Neotropical Migratory Bird Conservation",
						"description": "For expenses necessary to carry out the Neotropical Migratory Bird Conservation Act (16 U.S.C. 6101 et seq.).",
						"amount": 3910000.0
					},
					{
						"id": "multinational-species-conservation-fund",
						"name": "Multinational Species Conservation Fund",
						"description": "For expenses necessary to carry out the African Elephant Conservation Act (16 U.S.C. 4201 et seq.), the Asian Elephant Conservation Act of 1997 (16 U.S.C. 4261 et seq.), the Rhinoceros and Tiger Conservation Act of 1994 (16 U.S.C. 5301 et seq.), the Great Ape Conservation Act of 2000 (16 U.S.C. 6301 et seq.), and the Marine Turtle Conservation Act of 2004 (16 U.S.C. 6601 et seq.).",
						"amount": 11561000.0
					},
					{
						"id": "state-and-tribal-wildlife-grants",
						"name": "State And Tribal Wildlife Grants",
						"description": "For wildlife conservation grants to States and to the District of Columbia, Puerto Rico, Guam, the United States Virgin Islands, the Northern Mariana Islands, American Samoa, and Indian tribes under the provisions of the Fish and Wildlife Act of 1956 and the Fish and Wildlife Coordination Act, for the development and implementation of programs for the benefit of wildlife and their habitat, including species that are not hunted or fished.",
						"amount": 64571000.0
					}
				]
			},
			{
				"id": "national-park-service",
				"name": "National Park Service",
				"children": [
					{
						"id": "operation-of-the-national-park-system",
						"name": "Operation Of The National Park System",
						"description": "For expenses necessary for the management, operation, and maintenance of areas and facilities administered by the National Park Service and for the general administration of the National Park Service.",
						"amount": 2502711000.0
					},
					{
						"id": "national-recreation-and-preservation",
						"name": "National Recreation And Preservation",
						"description": "For expenses necessary to carry out recreation programs, natural programs, cultural programs, heritage partnership programs, environmental compliance and review, international park affairs, and grant administration, not otherwise provided for.",
						"amount": 64138000.0
					},
					{
						"id": "historic-preservation-fund",
						"name": "Historic Preservation Fund",
						"description": "For expenses necessary in carrying out the National Historic Preservation Act (division A of subtitle III of title 54, United States Code).",
						"amount": 102660000.0
					},
					{
						"id": "construction-6",
						"name": "Construction",
						"description": "For construction, improvements, repair, or replacement of physical facilities, and compliance and planning for programs and areas administered by the National Park Service.",
						"amount": 364704000.0
					},
					{
						"id": "land-acquisition-and-state-assistance",
						"name": "Land Acquisition And State Assistance",
						"description": "For expenses necessary to carry out chapter 2003 of title 54, United States Code, including administrative expenses, and for acquisition of lands or waters, or interest therein, in accordance with the statutory authority applicable to the National Park Service.",
						"amount": 168444000.0
					},
					{
						"id": "centennial-challenge",
						"name": "Centennial Challenge ",
						"description": "For expenses necessary to carry out the provisions of section 101701 of title 54, United States Code, relating to challenge cost share agreements.",
						"amount": 20000000.0
					}
				]
			},
			{
				"id": "united-states-geological-survey",
				"name": "United States Geological Survey",
				"description": "For expenses necessary for the United States Geological Survey to perform surveys, investigations, and research covering topography, geology, hydrology, biology, and the mineral and water resources of the United States, its territories and possessions, and other areas as authorized by 43 U.S.C. 31, 1332, and 1340; classify lands as to their mineral and water resources; give engineering supervision to power permittees and Federal Energy Regulatory Commission licensees; administer the minerals exploration program (30 U.S.C. 641); conduct inquiries into the economic conditions affecting mining and materials processing industries (30 U.S.C. 3, 21a, and 1603; 50 U.S.C. 98g(1)) and related purposes as authorized by law; and to publish and disseminate data relative to the foregoing activities.",
				"amount": 1160596000.0
			},
			{
				"id": "bureau-of-ocean-energy-management",
				"name": "Bureau Of Ocean Energy Management",
				"description": "For expenses necessary for granting and administering leases, easements, rights-of-way and agreements for use for oil and gas, other minerals, energy, and marine-related purposes on the Outer Continental Shelf and approving operations related thereto, as authorized by law; for environmental studies, as authorized by law; for implementing other laws and to the extent provided by Presidential or Secretarial delegation; and for matching grants or cooperative agreements.",
				"amount": 179266000.0
			},
			{
				"id": "bureau-of-safety-and-environmental-enforcement",
				"name": "Bureau Of Safety And Environmental Enforcement",
				"children": [
					{
						"id": "offshore-safety-and-environmental-enforcement",
						"name": "Offshore Safety And Environmental Enforcement",
						"description": "For expenses necessary for the regulation of operations related to leases, easements, rights-of-way and agreements for use for oil and gas, other minerals, energy, and marine-related purposes on the Outer Continental Shelf, as authorized by law; for enforcing and implementing laws and regulations as authorized by law and to the extent provided by Presidential or Secretarial delegation; and for matching grants or cooperative agreements.",
						"amount": 145475000.0
					},
					{
						"id": "oil-spill-research",
						"name": "Oil Spill Research",
						"description": "For necessary expenses to carry out title I, section 1016, title IV, sections 4202 and 4303, title VII, and title VIII, section 8201 of the Oil Pollution Act of 1990.",
						"amount": 14899000.0
					}
				]
			},
			{
				"id": "office-of-surface-mining-reclamation-and-enforcement",
				"name": "Office Of Surface Mining Reclamation And Enforcement",
				"children": [
					{
						"id": "regulation-and-technology",
						"name": "Regulation And Technology",
						"description": "For necessary expenses to carry out the provisions of the Surface Mining Control and Reclamation Act of 1977, Public Law 95–87.",
						"amount": 115804000.0
					},
					{
						"id": "abandoned-mine-reclamation-fund",
						"name": "Abandoned Mine Reclamation Fund",
						"description": "For necessary expenses to carry out title IV of the Surface Mining Control and Reclamation Act of 1977, Public Law 95–87.",
						"amount": 24672000.0
					}
				]
			},
			{
				"id": "bureau-of-indian-affairs-and-bureau-of-indian-education",
				"name": "Bureau Of Indian Affairs And Bureau Of Indian Education",
				"children": [
					{
						"id": "operation-of-indian-programs",
						"name": "Operation Of Indian Programs",
						"description": "For expenses necessary for the operation of Indian programs, as authorized by law, including the Snyder Act of November 2, 1921 (25 U.S.C. 13), the Indian Self-Determination and Education Assistance Act of 1975 (25 U.S.C. 5301 et seq.), the Education Amendments of 1978 (25 U.S.C. 2001–2019), and the Tribally Controlled Schools Act of 1988 (25 U.S.C. 2501 et seq.).",
						"amount": 2414577000.0
					},
					{
						"id": "construction-7",
						"name": "Construction",
						"description": "For construction, repair, improvement, and maintenance of irrigation and power systems, buildings, utilities, and other facilities, including architectural and engineering services by contract; acquisition of lands, and interests in lands; and preparation of lands for farming, and for construction of the Navajo Indian Irrigation Project pursuant to Public Law 87–483.",
						"amount": 358719000.0
					},
					{
						"id": "indian-land-and-water-claim-settlements-and-miscellaneous-payments-to-indians",
						"name": "Indian Land And Water Claim Settlements And Miscellaneous Payments To Indians",
						"description": "For payments and necessary administrative expenses for implementation of Indian land and water claim settlements pursuant to Public Laws 99–264, 100–580, 101–618, 111–11, 111–291, and 114–322, and for implementation of other land and water rights settlements.",
						"amount": 50057000.0
					},
					{
						"id": "indian-guaranteed-loan-program-account",
						"name": "Indian Guaranteed Loan Program Account",
						"description": "For the cost of guaranteed loans and insured loans.",
						"amount": 10779000.0
					}
				]
			},
			{
				"id": "office-of-the-secretary-4",
				"name": "Office Of The Secretary",
				"description": "For necessary expenses for management of the Department of the Interior and for grants and cooperative agreements, as authorized by law.",
				"amount": 124673000.0
			},
			{
				"id": "insular-affairs",
				"name": "Insular Affairs",
				"children": [
					{
						"id": "assistance-to-territories",
						"name": "Assistance To Territories",
						"description": "For expenses necessary for assistance to territories under the jurisdiction of the Department of the Interior and other jurisdictions identified in section 104(e) of Public Law 108–188.",
						"amount": 100688000.0
					},
					{
						"id": "compact-of-free-association",
						"name": "Compact Of Free Association",
						"description": "For grants and necessary expenses.",
						"amount": 3413000.0
					}
				]
			},
			{
				"id": "office-of-the-solicitor",
				"name": "Office Of The Solicitor",
				"description": "For necessary expenses of the Office of the Solicitor.",
				"amount": 65674000.0
			},
			{
				"id": "office-of-inspector-general-17",
				"name": "Office Of Inspector General",
				"description": "For necessary expenses of the Office of Inspector General.",
				"amount": 52486000.0
			},
			{
				"id": "office-of-the-special-trustee-for-american-indians",
				"name": "Office Of The Special Trustee For American Indians",
				"description": "For the operation of trust programs for Indians by direct expenditure, contracts, cooperative agreements, compacts, and grants.",
				"amount": 111540000.0
			},
			{
				"id": "department-wide-programs",
				"name": "Department-Wide Programs",
				"children": [
					{
						"id": "wildland-fire-management",
						"name": "Wildland Fire Management",
						"description": "For necessary expenses for fire preparedness, fire suppression operations, fire science and research, emergency rehabilitation, fuels management activities, and rural fire assistance by the Department of the Interior.",
						"amount": 941211000.0
					},
					{
						"id": "central-hazardous-materials-fund",
						"name": "Central Hazardous Materials Fund",
						"description": "For necessary expenses of the Department of the Interior and any of its component offices and bureaus for the response action, including associated activities, performed pursuant to the Comprehensive Environmental Response, Compensation, and Liability Act (42 U.S.C. 9601 et seq.).",
						"amount": 10010000.0
					}
				]
			},
			{
				"id": "natural-resource-damage-assessment-and-restoration",
				"name": "Natural Resource Damage Assessment And Restoration",
				"children": [
					{
						"id": "working-capital-fund",
						"name": "Working Capital Fund",
						"description": "For the operation and maintenance of a departmental financial and business management system, information technology improvements of general benefit to the Department, cybersecurity, and the consolidation of facilities and operations throughout the Department.",
						"amount": 55735000.0
					},
					{
						"id": "office-of-natural-resources-revenue",
						"name": "Office Of Natural Resources Revenue ",
						"description": "For necessary expenses for management of the collection and disbursement of royalties, fees, and other mineral revenue proceeds, and for grants and cooperative agreements, as authorized by law.",
						"amount": 137505000.0
					}
				]
			}
		]
	},
	{
		"id": "environmental-protection-agency",
		"name": "Environmental Protection Agency",
		"children": [
			{
				"id": "science-and-technology",
				"name": "Science And Technology",
				"description": "For science and technology, including research and development activities, which shall include research and development activities under the Comprehensive Environmental Response, Compensation, and Liability Act of 1980; necessary expenses for personnel and related costs and travel expenses; procurement of laboratory equipment and supplies; and other operating expenses in support of research and development.",
				"amount": 717723000.0
			},
			{
				"id": "environmental-programs-and-management",
				"name": "Environmental Programs And Management ",
				"description": "For environmental programs and management, including necessary expenses, not otherwise provided for, for personnel and related costs and travel expenses; hire of passenger motor vehicles; hire, maintenance, and operation of aircraft; purchase of reprints; library memberships in societies or associations which issue publications to members only or at a price to members lower than to subscribers who are not members; administrative costs of the brownfields program under the Small Business Liability Relief and Brownfields Revitalization Act of 2002; implementation of a coal combustion residual permit program under section 2301 of the Water and Waste Act of 2016; and not to exceed $9,000 for official reception and representation expenses.",
				"amount": 2658200000.0
			},
			{
				"id": "hazardous-waste-electronic-manifest-system-fund",
				"name": "Hazardous Waste Electronic Manifest System Fund",
				"description": "For necessary expenses to carry out section 3024 of the Solid Waste Disposal Act (42 U.S.C. 6939g), including the development, operation, maintenance, and upgrading of the hazardous waste electronic manifest system established by such section.",
				"amount": 8000000.0
			},
			{
				"id": "office-of-inspector-general-18",
				"name": "Office Of Inspector General",
				"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978.",
				"amount": 41489000.0
			},
			{
				"id": "buildings-and-facilities-7",
				"name": "Buildings And Facilities",
				"description": "For construction, repair, improvement, extension, alteration, and purchase of fixed equipment or facilities of, or for use by, the Environmental Protection Agency.",
				"amount": 34467000.0
			},
			{
				"id": "hazardous-substance-superfund",
				"name": "Hazardous Substance Superfund",
				"description": "For necessary expenses to carry out the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (CERCLA), including sections 111(c)(3), (c)(5), (c)(6), and (e)(4) (42 U.S.C. 9611) $1,091,947,000, to remain available until expended, consisting of such sums as are available in the Trust Fund on September 30, 2018, as authorized by section 517(a) of the Superfund Amendments and Reauthorization Act of 1986 (SARA) and up to $1,091,947,000 as a payment from general revenues to the Hazardous Substance Superfund for purposes as authorized by section 517(b) of SARA: Provided, That funds appropriated under this heading may be allocated to other Federal agencies in accordance with section 111(a) of CERCLA: Provided further, That of the funds appropriated under this heading.",
				"amount": 8778000.0
			},
			{
				"id": "leaking-underground-storage-tank-trust-fund-program",
				"name": "Leaking Underground Storage Tank Trust Fund Program",
				"description": "For necessary expenses to carry out leaking underground storage tank cleanup activities authorized by subtitle I of the Solid Waste Disposal Act.",
				"amount": 91941000.0
			},
			{
				"id": "inland-oil-spill-programs",
				"name": "Inland Oil Spill Programs",
				"description": "For expenses necessary to carry out the Environmental Protection Agency’s responsibilities under the Oil Pollution Act of 1990.",
				"amount": 18209000.0
			},
			{
				"id": "state-and-tribal-assistance-grants",
				"name": "State And Tribal Assistance Grants",
				"description": "For environmental programs and infrastructure assistance, including capitalization grants for State revolving funds and performance partnership grants.",
				"amount": 3605041000.0
			},
			{
				"id": "water-infrastructure-finance-and-innovation-program-account",
				"name": "Water Infrastructure Finance And Innovation Program Account",
				"description": "For the cost of direct loans and for the cost of guaranteed loans, as authorized by the Water Infrastructure Finance and Innovation Act of 2014.",
				"amount": 5000000.0
			}
		]
	},
	{
		"id": "related-agencies-5",
		"name": "Related Agencies",
		"children": [
			{
				"id": "department-of-agriculture",
				"name": "Department Of Agriculture",
				"children": [
					{
						"id": "office-of-the-under-secretary-for-natural-resources-and-environment",
						"name": "Office Of The Under Secretary For Natural Resources And Environment",
						"description": "For necessary expenses of the Office of the Under Secretary for Natural Resources and Environment.",
						"amount": 875000.0
					},
					{
						"id": "forest-service",
						"name": "Forest Service",
						"children": [
							{
								"id": "forest-and-rangeland-research",
								"name": "Forest And Rangeland Research",
								"description": "For necessary expenses of forest and rangeland research as authorized by law.",
								"amount": 300000000.0
							},
							{
								"id": "state-and-private-forestry",
								"name": "State And Private Forestry",
								"description": "For necessary expenses of cooperating with and providing technical and financial assistance to States, territories, possessions, and others, and for forest health management, and conducting an international program as authorized.",
								"amount": 336990000.0
							},
							{
								"id": "national-forest-system",
								"name": "National Forest System",
								"description": "For necessary expenses of the Forest Service, not otherwise provided for, for management, protection, improvement, and utilization of the National Forest System, and for hazardous fuels management on or adjacent to such lands.",
								"amount": 1938000000.0
							},
							{
								"id": "capital-improvement-and-maintenance",
								"name": "Capital Improvement And Maintenance",
								"description": "For necessary expenses of the Forest Service, not otherwise provided for.",
								"amount": 446000000.0
							},
							{
								"id": "land-acquisition-3",
								"name": "Land Acquisition",
								"description": "For expenses necessary to carry out the provisions of chapter 2003 of title 54, United States Code, including administrative expenses, and for acquisition of land or waters, or interest therein, in accordance with statutory authority applicable to the Forest Service.",
								"amount": 72564000.0
							},
							{
								"id": "acquisition-of-lands-for-national-forests-special-acts",
								"name": "Acquisition Of Lands For National Forests Special Acts",
								"description": "For acquisition of lands within the exterior boundaries of the Cache, Uinta, and Wasatch National Forests, Utah; the Toiyabe National Forest, Nevada; and the Angeles, San Bernardino, Sequoia, and Cleveland National Forests, California; and the Ozark-St. Francis and Ouachita National Forests, Arkansas; as authorized by law.",
								"amount": 700000.0
							},
							{
								"id": "gifts%2C-donations-and-bequests-for-forest-and-rangeland-research",
								"name": "Gifts, Donations And Bequests For Forest And Rangeland Research",
								"description": "For expenses authorized by 16 U.S.C. 1643(b).",
								"amount": 45000.0
							},
							{
								"id": "management-of-national-forest-lands-for-subsistence-uses",
								"name": "Management Of National Forest Lands For Subsistence Uses",
								"description": "For necessary expenses of the Forest Service to manage Federal lands in Alaska for subsistence uses under title VIII of the Alaska National Interest Lands Conservation Act (16 U.S.C. 3111 et seq.).",
								"amount": 2500000.0
							},
							{
								"id": "wildland-fire-management-2",
								"name": "Wildland Fire Management",
								"description": "For necessary expenses for forest fire presuppression activities on National Forest System lands, for emergency wildland fire suppression on or adjacent to such lands or other lands under fire protection agreement, and for emergency rehabilitation of burned-over National Forest System lands and water.",
								"amount": 3004986000.0
							}
						]
					}
				]
			},
			{
				"id": "department-of-health-and-human-services-2",
				"name": "Department Of Health And Human Services",
				"children": [
					{
						"id": "indian-health-service",
						"name": "Indian Health Service",
						"children": [
							{
								"id": "indian-health-services",
								"name": "Indian Health Services",
								"description": "For expenses necessary to carry out the Act of August 5, 1954 (68 Stat. 674), the Indian Self-Determination and Education Assistance Act, the Indian Health Care Improvement Act, and titles II and III of the Public Health Service Act with respect to the Indian Health Service.",
								"amount": 4103190000.0
							},
							{
								"id": "indian-health-facilities",
								"name": "Indian Health Facilities",
								"description": "For construction, repair, maintenance, improvement, and equipment of health and related auxiliary facilities, including quarters for personnel; preparation of plans, specifications, and drawings; acquisition of sites, purchase and erection of modular buildings, and purchases of trailers; and for provision of domestic and community sanitation facilities for Indians, as authorized by section 7 of the Act of August 5, 1954 (42 U.S.C. 2004a), the Indian Self-Determination Act, and the Indian Health Care Improvement Act, and for expenses necessary to carry out such Acts and titles II and III of the Public Health Service Act with respect to environmental health and facilities support activities of the Indian Health Service.",
								"amount": 878806000.0
							}
						]
					},
					{
						"id": "national-institutes-of-health-2",
						"name": "National Institutes Of Health",
						"description": "For necessary expenses for the National Institute of Environmental Health Sciences in carrying out activities set forth in section 311(a) of the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (42 U.S.C. 9660(a)) and section 126(g) of the Superfund Amendments and Reauthorization Act of 1986.",
						"amount": 79000000.0
					},
					{
						"id": "agency-for-toxic-substances-and-disease-registry",
						"name": "Agency For Toxic Substances And Disease Registry ",
						"description": "For necessary expenses for the Agency for Toxic Substances and Disease Registry (ATSDR) in carrying out activities set forth in sections 104(i) and 111(c)(4) of the Comprehensive Environmental Response, Compensation, and Liability Act of 1980 (CERCLA) and section 3019 of the Solid Waste Disposal Act.",
						"amount": 74691000.0
					}
				]
			},
			{
				"id": "other-related-agencies",
				"name": "Other Related Agencies",
				"children": [
					{
						"id": "executive-office-of-the-president",
						"name": "Executive Office Of The President",
						"description": "For necessary expenses to continue functions assigned to the Council on Environmental Quality and Office of Environmental Quality pursuant to the National Environmental Policy Act of 1969, the Environmental Quality Improvement Act of 1970, and Reorganization Plan No. 1 of 1977, and not to exceed $750 for official reception and representation expenses.",
						"amount": 2994000.0
					},
					{
						"id": "chemical-safety-and-hazard-investigation-board",
						"name": "Chemical Safety And Hazard Investigation Board",
						"description": "For necessary expenses in carrying out activities pursuant to section 112(r)(6) of the Clean Air Act, including hire of passenger vehicles, uniforms or allowances therefor, as authorized by 5 U.S.C. 5901–5902, and for services authorized by 5 U.S.C. 3109 but at rates for individuals not to exceed the per diem equivalent to the maximum rate payable for senior level positions under 5 U.S.C. 5376.",
						"amount": 12000000.0
					},
					{
						"id": "office-of-navajo-and-hopi-indian-relocation",
						"name": "Office Of Navajo And Hopi Indian Relocation",
						"description": "For necessary expenses of the Office of Navajo and Hopi Indian Relocation as authorized by Public Law 93–531.",
						"amount": 8750000.0
					},
					{
						"id": "institute-of-american-indian-and-alaska-native-culture-and-arts-development",
						"name": "Institute Of American Indian And Alaska Native Culture And Arts Development",
						"description": "For payment to the Institute of American Indian and Alaska Native Culture and Arts Development, as authorized by part A of title XV of Public Law 99–498 (20 U.S.C. 4411 et seq.).",
						"amount": 9960000.0
					},
					{
						"id": "smithsonian-institution",
						"name": "Smithsonian Institution",
						"children": [
							{
								"id": "salaries-and-expenses-33",
								"name": "Salaries And Expenses",
								"description": "For necessary expenses of the Smithsonian Institution, as authorized by law, including research in the fields of art, science, and history; development, preservation, and documentation of the National Collections; presentation of public exhibits and performances; collection, preparation, dissemination, and exchange of information and publications; conduct of education, training, and museum assistance programs; maintenance, alteration, operation, lease agreements of no more than 30 years, and protection of buildings, facilities, and approaches; not to exceed $100,000 for services as authorized by 5 U.S.C. 3109; and purchase, rental, repair, and cleaning of uniforms for employees.",
								"amount": 739994000.0
							},
							{
								"id": "facilities-capital",
								"name": "Facilities Capital",
								"description": "For necessary expenses of repair, revitalization, and alteration of facilities owned or occupied by the Smithsonian Institution, by contract or otherwise, as authorized by section 2 of the Act of August 22, 1949 (63 Stat. 623), and for construction, including necessary personnel.",
								"amount": 303503000.0
							}
						]
					},
					{
						"id": "national-gallery-of-art",
						"name": "National Gallery Of Art",
						"children": [
							{
								"id": "salaries-and-expenses-34",
								"name": "Salaries And Expenses",
								"description": "For the upkeep and operations of the National Gallery of Art, the protection and care of the works of art therein, and administrative expenses incident thereto, as authorized by the Act of March 24, 1937 (50 Stat. 51), as amended by the public resolution of April 13, 1939 (Public Resolution 9, Seventy-sixth Congress), including services as authorized by 5 U.S.C. 3109; payment in advance when authorized by the treasurer of the Gallery for membership in library, museum, and art associations or societies whose publications or services are available to members only, or to members at a price lower than to the general public; purchase, repair, and cleaning of uniforms for guards, and uniforms, or allowances therefor, for other employees as authorized by law (5 U.S.C. 5901–5902); purchase or rental of devices and services for protecting buildings and contents thereof, and maintenance, alteration, improvement, and repair of buildings, approaches, and grounds; and purchase of services for restoration and repair of works of art for the National Gallery of Art by contracts made, without advertising, with individuals, firms, or organizations at such rates or prices and under such terms and conditions as the Gallery may deem proper.",
								"amount": 144202000.0
							},
							{
								"id": "repair%2C-restoration-and-renovation-of-buildings",
								"name": "Repair, Restoration And Renovation Of Buildings",
								"description": "For necessary expenses of repair, restoration and renovation of buildings, grounds and facilities owned or occupied by the National Gallery of Art, by contract or otherwise, for operating lease agreements of no more than 10 years, with no extensions or renewals beyond the 10 years, that address space needs created by the ongoing renovations in the Master Facilities Plan, as authorized.",
								"amount": 24203000.0
							}
						]
					},
					{
						"id": "john-f.-kennedy-center-for-the-performing-arts",
						"name": "John F. Kennedy Center For The Performing Arts",
						"children": [
							{
								"id": "operations-and-maintenance",
								"name": "Operations And Maintenance",
								"description": "For necessary expenses for the operation, maintenance and security of the John F. Kennedy Center for the Performing Arts.",
								"amount": 24490000.0
							},
							{
								"id": "capital-repair-and-restoration",
								"name": "Capital Repair And Restoration",
								"description": "For necessary expenses for capital repair and restoration of the existing features of the building and site of the John F. Kennedy Center for the Performing Arts.",
								"amount": 16800000.0
							}
						]
					},
					{
						"id": "woodrow-wilson-international-center-for-scholars",
						"name": "Woodrow Wilson International Center For Scholars",
						"description": "For expenses necessary in carrying out the provisions of the Woodrow Wilson Memorial Act of 1968 (82 Stat. 1356) including hire of passenger vehicles and services as authorized by 5 U.S.C. 3109.",
						"amount": 12000000.0
					},
					{
						"id": "national-endowment-for-the-arts",
						"name": "National Endowment For The Arts",
						"description": "For necessary expenses to carry out the National Foundation on the Arts and the Humanities Act of 1965.",
						"amount": 155000000.0
					},
					{
						"id": "national-endowment-for-the-humanities",
						"name": "National Endowment For The Humanities",
						"description": "For necessary expenses to carry out the National Foundation on the Arts and the Humanities Act of 1965.",
						"amount": 155000000.0
					},
					{
						"id": "commission-of-fine-arts",
						"name": "Commission Of Fine Arts",
						"children": [
							{
								"id": "salaries-and-expenses-35",
								"name": "Salaries And Expenses",
								"description": "For expenses of the Commission of Fine Arts under chapter 91 of title 40, United States Code.",
								"amount": 2771000.0
							},
							{
								"id": "national-capital-arts-and-cultural-affairs",
								"name": "National Capital Arts And Cultural Affairs ",
								"description": "For necessary expenses as authorized by Public Law 99–190 (20 U.S.C. 956a).",
								"amount": 2750000.0
							}
						]
					},
					{
						"id": "advisory-council-on-historic-preservation",
						"name": "Advisory Council On Historic Preservation",
						"description": "For necessary expenses of the Advisory Council on Historic Preservation (Public Law 89–665).",
						"amount": 6890000.0
					},
					{
						"id": "national-capital-planning-commission",
						"name": "National Capital Planning Commission",
						"description": "For necessary expenses of the National Capital Planning Commission under chapter 87 of title 40, United States Code, including services as authorized by 5 U.S.C. 3109.",
						"amount": 8099000.0
					},
					{
						"id": "united-states-holocaust-memorial-museum",
						"name": "United States Holocaust Memorial Museum",
						"description": "For expenses of the Holocaust Memorial Museum, as authorized by Public Law 106–292 (36 U.S.C. 2301–2310).",
						"amount": 59000000.0
					},
					{
						"id": "dwight-d.-eisenhower-memorial-commission",
						"name": "Dwight D. Eisenhower Memorial Commission",
						"children": [
							{
								"id": "salaries-and-expenses-36",
								"name": "Salaries And Expenses ",
								"description": "For necessary expenses of the Dwight D. Eisenhower Memorial Commission.",
								"amount": 1800000.0
							},
							{
								"id": "salaries-and-expenses-37",
								"name": "Salaries And Expenses",
								"description": "For necessary expenses for the Women’s Suffrage Centennial Commission, as authorized by the Women’s Suffrage Centennial Commission Act (section 431(a)(3) of division G of Public Law 115–31).",
								"amount": 1000000.0
							}
						]
					}
				]
			}
		]
	},
	{
		"id": "general-provisions-3",
		"name": "General Provisions",
		"children": [
			{
				"id": null,
				"name": null,
				"description": "For an additional amount for Environmental Protection Agency—State and Tribal Assistance Grants, for environmental programs and infrastructure assistance, including capitalization grants for State revolving funds and performance partnership grants.",
				"amount": 665000000.0
			},
			{
				"id": null,
				"name": null,
				"description": "For an additional amount for Environmental Protection Agency—Water Infrastructure Finance and Innovation Program Account.",
				"amount": 58000000.0
			}
		]
	},
	{
		"id": "department-of-state-and-related-agency",
		"name": "Department Of State And Related Agency",
		"children": [
			{
				"id": "department-of-state",
				"name": "Department Of State",
				"children": [
					{
						"id": "administration-of-foreign-affairs",
						"name": "Administration Of Foreign Affairs",
						"children": [
							{
								"id": "diplomatic-programs",
								"name": "Diplomatic Programs",
								"description": "For necessary expenses of the Department of State and the Foreign Service not otherwise provided for.",
								"children": [
									{
										"id": "human-resources",
										"name": "Human Resources",
										"description": "For necessary expenses for training, human resources management, and salaries, including employment without regard to civil service and classification laws of persons on a temporary basis (not to exceed $700,000), as authorized by section 801 of the United States Information and Educational Exchange Act of 1948.",
										"amount": 2871794000.0
									},
									{
										"id": "overseas-programs",
										"name": "Overseas Programs",
										"description": "For necessary expenses for the regional bureaus of the Department of State and overseas activities as authorized by law.",
										"amount": 1338227000.0
									},
									{
										"id": "diplomatic-policy-and-support",
										"name": "Diplomatic Policy And Support",
										"description": "For necessary expenses for the functional bureaus of the Department of State, including representation to certain international organizations in which the United States participates pursuant to treaties ratified pursuant to the advice and consent of the Senate or specific Acts of Congress, general administration, and arms control, nonproliferation and disarmament activities as authorized.",
										"amount": 773847000.0
									},
									{
										"id": "security-programs",
										"name": "Security Programs",
										"description": "For necessary expenses for security activities.",
										"amount": 964084000.0
									}
								]
							},
							{
								"id": "capital-investment-fund",
								"name": "Capital Investment Fund ",
								"description": "For necessary expenses of the Capital Investment Fund, as authorized.",
								"amount": 92770000.0
							},
							{
								"id": "office-of-inspector-general-19",
								"name": "Office Of Inspector General",
								"description": "For necessary expenses of the Office of Inspector General.",
								"amount": 90829000.0
							},
							{
								"id": "educational-and-cultural-exchange-programs",
								"name": "Educational And Cultural Exchange Programs",
								"description": "For expenses of educational and cultural exchange programs, as authorized.",
								"amount": 700946000.0
							},
							{
								"id": "representation-expenses",
								"name": "Representation Expenses",
								"description": "For representation expenses as authorized.",
								"amount": 8030000.0
							},
							{
								"id": "protection-of-foreign-missions-and-officials",
								"name": "Protection Of Foreign Missions And Officials",
								"description": "For expenses, not otherwise provided, to enable the Secretary of State to provide for extraordinary protective services, as authorized.",
								"amount": 30890000.0
							},
							{
								"id": "embassy-security%2C-construction%2C-and-maintenance",
								"name": "Embassy Security, Construction, And Maintenance",
								"description": "For necessary expenses for carrying out the Foreign Service Buildings Act of 1926 (22 U.S.C. 292 et seq.), preserving, maintaining, repairing, and planning for real property that are owned or leased by the Department of State, and renovating, in addition to funds otherwise available, the Harry S Truman Building.",
								"amount": 777200000.0
							},
							{
								"id": "emergencies-in-the-diplomatic-and-consular-service",
								"name": "Emergencies In The Diplomatic And Consular Service",
								"description": "For necessary expenses to enable the Secretary of State to meet unforeseen emergencies arising in the Diplomatic and Consular Service, as authorized.",
								"amount": 7885000.0
							},
							{
								"id": "repatriation-loans-program-account",
								"name": "Repatriation Loans Program Account",
								"description": "For the cost of direct loans.",
								"amount": 1300000.0
							},
							{
								"id": "payment-to-the-american-institute-in-taiwan",
								"name": "Payment To The American Institute In Taiwan",
								"description": "For necessary expenses to carry out the Taiwan Relations Act (Public Law 96–8).",
								"amount": 31963000.0
							},
							{
								"id": "payment-to-the-foreign-service-retirement-and-disability-fund",
								"name": "Payment To The Foreign Service Retirement And Disability Fund",
								"description": "For payment to the Foreign Service Retirement and Disability Fund, as authorized.",
								"amount": 158900000.0
							}
						]
					},
					{
						"id": "international-organizations",
						"name": "International Organizations",
						"children": [
							{
								"id": "contributions-to-international-organizations",
								"name": "Contributions To International Organizations",
								"description": "For necessary expenses, not otherwise provided for, to meet annual obligations of membership in international multilateral organizations, pursuant to treaties ratified pursuant to the advice and consent of the Senate, conventions, or specific Acts of Congress.",
								"amount": 1264030000.0
							},
							{
								"id": "contributions-for-international-peacekeeping-activities",
								"name": "Contributions For International Peacekeeping Activities",
								"description": "For necessary expenses to pay assessed and other expenses of international peacekeeping activities directed to the maintenance or restoration of international peace and security.",
								"amount": 562344000.0
							}
						]
					},
					{
						"id": "international-commissions",
						"name": "International Commissions",
						"description": "For necessary expenses, not otherwise provided for, to meet obligations of the United States arising under treaties, or specific Acts of Congress, as follows:",
						"children": [
							{
								"id": "salaries-and-expenses-38",
								"name": "Salaries And Expenses",
								"description": "For salaries and expenses, not otherwise provided for.",
								"amount": 48134000.0
							},
							{
								"id": "construction-8",
								"name": "Construction",
								"description": "For detailed plan preparation and construction of authorized projects.",
								"amount": 29400000.0
							},
							{
								"id": "american-sections%2C-international-commissions",
								"name": "American Sections, International Commissions",
								"description": "For necessary expenses, not otherwise provided, for the International Joint Commission and the International Boundary Commission, United States and Canada, as authorized by treaties between the United States and Canada or Great Britain, and the Border Environment Cooperation Commission as authorized by the North American Free Trade Agreement Implementation Act (Public Law 103–182).",
								"amount": 13258000.0
							},
							{
								"id": "international-fisheries-commissions",
								"name": "International Fisheries Commissions",
								"description": "For necessary expenses for international fisheries commissions, not otherwise provided for, as authorized by law.",
								"amount": 50651000.0
							}
						]
					}
				]
			},
			{
				"id": "related-agency",
				"name": "Related Agency",
				"children": [
					{
						"id": "international-broadcasting-operations",
						"name": "International Broadcasting Operations",
						"description": "For necessary expenses to enable the Broadcasting Board of Governors (BBG), as authorized, to carry out international communication activities, and to make and supervise grants for radio, Internet, and television broadcasting to the Middle East.",
						"amount": 798196000.0
					},
					{
						"id": "broadcasting-capital-improvements",
						"name": "Broadcasting Capital Improvements",
						"description": "For the purchase, rent, construction, repair, preservation, and improvement of facilities for radio, television, and digital transmission and reception; the purchase, rent, and installation of necessary equipment for radio, television, and digital transmission and reception, including to Cuba, as authorized; and physical security worldwide, in addition to amounts otherwise available for such purposes.",
						"amount": 9700000.0
					}
				]
			},
			{
				"id": "related-programs",
				"name": "Related Programs",
				"children": [
					{
						"id": "the-asia-foundation",
						"name": "The Asia Foundation",
						"description": "For a grant to The Asia Foundation, as authorized by The Asia Foundation Act (22 U.S.C. 4402).",
						"amount": 17000000.0
					},
					{
						"id": "united-states-institute-of-peace",
						"name": "United States Institute Of Peace",
						"description": "For necessary expenses of the United States Institute of Peace, as authorized by the United States Institute of Peace Act (22 U.S.C. 4601 et seq.).",
						"amount": 38634000.0
					},
					{
						"id": "national-endowment-for-democracy",
						"name": "National Endowment For Democracy",
						"description": "For grants made by the Department of State to the National Endowment for Democracy, as authorized by the National Endowment for Democracy Act (22 U.S.C. 4412).",
						"amount": 180000000.0
					}
				]
			},
			{
				"id": "other-commissions",
				"name": "Other Commissions",
				"children": [
					{
						"id": "commission-for-the-preservation-of-america%E2%80%99s-heritage-abroad",
						"name": "Commission For The Preservation Of America’S Heritage Abroad",
						"description": "For necessary expenses for the Commission for the Preservation of America’s Heritage Abroad.",
						"amount": 675000.0
					},
					{
						"id": "united-states-commission-on-international-religious-freedom",
						"name": "United States Commission On International Religious Freedom",
						"description": "For necessary expenses for the United States Commission on International Religious Freedom (USCIRF), as authorized by title II of the International Religious Freedom Act of 1998 (22 U.S.C. 6431 et seq.).",
						"amount": 4500000.0
					},
					{
						"id": "commission-on-security-and-cooperation-in-europe",
						"name": "Commission On Security And Cooperation In Europe",
						"description": "For necessary expenses of the Commission on Security and Cooperation in Europe, as authorized by Public Law 94–304 (22 U.S.C. 3001 et seq.).",
						"amount": 2579000.0
					},
					{
						"id": "congressional-executive-commission-on-the-people%27s-republic-of-china",
						"name": "Congressional-Executive Commission On The People'S Republic Of China",
						"description": "For necessary expenses of the Congressional-Executive Commission on the People's Republic of China, as authorized by title III of the U.S.-China Relations Act of 2000 (22 U.S.C. 6911 et seq.).",
						"amount": 2000000.0
					},
					{
						"id": "united-states-china-economic-and-security-review-commission",
						"name": "United States-China Economic And Security Review Commission",
						"description": "For necessary expenses of the United States-China Economic and Security Review Commission, as authorized by section 1238 of the Floyd D. Spence National Defense Authorization Act for Fiscal Year 2001 (22 U.S.C. 7002).",
						"amount": 3500000.0
					},
					{
						"id": "western-hemisphere-drug-policy-commission",
						"name": "Western Hemisphere Drug Policy Commission",
						"description": "For necessary expenses of the Western Hemisphere Drug Policy Commission, as authorized by title VI of the Department of State Authorities Act, Fiscal Year 2017 (Public Law 114–323).",
						"amount": 1500000.0
					}
				]
			}
		]
	},
	{
		"id": "united-states-agency-for-international-development",
		"name": "United States Agency For International Development",
		"children": [
			{
				"id": "operating-expenses-4",
				"name": "Operating Expenses",
				"description": "For necessary expenses to carry out the provisions of section 667 of the Foreign Assistance Act of 1961.",
				"amount": 1214808000.0
			},
			{
				"id": "capital-investment-fund-2",
				"name": "Capital Investment Fund",
				"description": "For necessary expenses for overseas construction and related costs, and for the procurement and enhancement of information technology and related capital investments, pursuant to section 667 of the Foreign Assistance Act of 1961.",
				"amount": 225000000.0
			},
			{
				"id": "office-of-inspector-general-20",
				"name": "Office Of Inspector General",
				"description": "For necessary expenses to carry out the provisions of section 667 of the Foreign Assistance Act of 1961.",
				"amount": 76600000.0
			}
		]
	},
	{
		"id": "bilateral-economic-assistance",
		"name": "Bilateral Economic Assistance",
		"children": [
			{
				"id": "funds-appropriated-to-the-president",
				"name": "Funds Appropriated To The President",
				"description": "For necessary expenses to enable the President to carry out the provisions of the Foreign Assistance Act of 1961, and for other purposes, as follows:",
				"children": [
					{
						"id": "development-assistance",
						"name": "Development Assistance",
						"description": "For necessary expenses to carry out the provisions of sections 103, 105, 106, 214, and sections 251 through 255, and chapter 10 of part I of the Foreign Assistance Act of 1961.",
						"amount": 3000000000.0
					},
					{
						"id": "international-disaster-assistance",
						"name": "International Disaster Assistance",
						"description": "For necessary expenses to carry out the provisions of section 491 of the Foreign Assistance Act of 1961 for international disaster relief, rehabilitation, and reconstruction assistance.",
						"amount": 3801034000.0
					},
					{
						"id": "transition-initiatives",
						"name": "Transition Initiatives",
						"description": "For necessary expenses for international disaster rehabilitation and reconstruction assistance administered by the Office of Transition Initiatives, United States Agency for International Development, pursuant to section 491 of the Foreign Assistance Act of 1961.",
						"amount": 30000000.0
					},
					{
						"id": "complex-crises-fund",
						"name": "Complex Crises Fund",
						"description": "For necessary expenses to carry out the provisions of the Foreign Assistance Act of 1961 to support programs and activities administered by the United States Agency for International Development to prevent or respond to emerging or unforeseen foreign challenges and complex crises overseas.",
						"amount": 30000000.0
					},
					{
						"id": "economic-support-fund",
						"name": "Economic Support Fund",
						"description": "For necessary expenses to carry out the provisions of chapter 4 of part II of the Foreign Assistance Act of 1961.",
						"amount": 2545525000.0
					},
					{
						"id": "democracy-fund",
						"name": "Democracy Fund",
						"description": "For necessary expenses to carry out the provisions of the Foreign Assistance Act of 1961 for the promotion of democracy globally, including to carry out the purposes of section 502(b)(3) and (5) of Public Law 98–164 (22 U.S.C. 4411).",
						"amount": 157700000.0
					},
					{
						"id": "assistance-for-europe%2C-eurasia-and-central-asia",
						"name": "Assistance For Europe, Eurasia And Central Asia",
						"description": "For necessary expenses to carry out the provisions of the Foreign Assistance Act of 1961, the FREEDOM Support Act (Public Law 102–511), and the Support for Eastern European Democracy (SEED) Act of 1989 (Public Law 101–179).",
						"amount": 760334000.0
					}
				]
			},
			{
				"id": "department-of-state-2",
				"name": "Department Of State",
				"children": [
					{
						"id": "migration-and-refugee-assistance",
						"name": "Migration And Refugee Assistance",
						"description": "For necessary expenses not otherwise provided for, to enable the Secretary of State to carry out the provisions of section 2(a) and (b) of the Migration and Refugee Assistance Act of 1962, and other activities to meet refugee and migration needs; salaries and expenses of personnel and dependents as authorized by the Foreign Service Act of 1980; allowances as authorized by sections 5921 through 5925 of title 5, United States Code; purchase and hire of passenger motor vehicles; and services as authorized by section 3109 of title 5, United States Code.",
						"amount": 2027876000.0
					},
					{
						"id": "united-states-emergency-refugee-and-migration-assistance-fund",
						"name": "United States Emergency Refugee And Migration Assistance Fund",
						"description": "For necessary expenses to carry out the provisions of section 2(c) of the Migration and Refugee Assistance Act of 1962, as amended (22 U.S.C. 2601(c)).",
						"amount": 1000000.0
					}
				]
			},
			{
				"id": "independent-agencies-3",
				"name": "Independent Agencies",
				"children": [
					{
						"id": "peace-corps",
						"name": "Peace Corps",
						"description": "For necessary expenses to carry out the provisions of the Peace Corps Act (22 U.S.C. 2501 et seq.), including the purchase of not to exceed five passenger motor vehicles for administrative purposes for use outside of the United States.",
						"amount": 410500000.0
					},
					{
						"id": "millennium-challenge-corporation",
						"name": "Millennium Challenge Corporation",
						"description": "For necessary expenses to carry out the provisions of the Millennium Challenge Act of 2003 (22 U.S.C. 7701 et seq.) (MCA).",
						"amount": 905000000.0
					},
					{
						"id": "inter-american-foundation",
						"name": "Inter-American Foundation",
						"description": "For necessary expenses to carry out the functions of the Inter-American Foundation in accordance with the provisions of section 401 of the Foreign Assistance Act of 1969.",
						"amount": 22500000.0
					},
					{
						"id": "united-states-african-development-foundation",
						"name": "United States African Development Foundation",
						"description": "For necessary expenses to carry out the African Development Foundation Act (title V of Public Law 96–533; 22 U.S.C. 290h et seq.).",
						"amount": 30000000.0
					}
				]
			},
			{
				"id": "department-of-the-treasury-2",
				"name": "Department Of The Treasury",
				"description": "For necessary expenses to carry out the provisions of section 129 of the Foreign Assistance Act of 1961.",
				"amount": 30000000.0
			}
		]
	},
	{
		"id": "international-security-assistance",
		"name": "International Security Assistance",
		"children": [
			{
				"id": "department-of-state-3",
				"name": "Department Of State",
				"children": [
					{
						"id": "international-narcotics-control-and-law-enforcement",
						"name": "International Narcotics Control And Law Enforcement",
						"description": "For necessary expenses to carry out section 481 of the Foreign Assistance Act of 1961.",
						"amount": 1497469000.0
					},
					{
						"id": "nonproliferation%2C-anti-terrorism%2C-demining-and-related-programs",
						"name": "Nonproliferation, Anti-Terrorism, Demining And Related Programs",
						"description": "For necessary expenses for nonproliferation, anti-terrorism, demining and related programs and activities.",
						"amount": 864550000.0
					},
					{
						"id": "peacekeeping-operations",
						"name": "Peacekeeping Operations",
						"description": "For necessary expenses to carry out the provisions of section 551 of the Foreign Assistance Act of 1961.",
						"amount": 163457000.0
					}
				]
			},
			{
				"id": "funds-appropriated-to-the-president-2",
				"name": "Funds Appropriated To The President",
				"description": "For necessary expenses to carry out the provisions of section 541 of the Foreign Assistance Act of 1961.",
				"amount": 110778000.0
			}
		]
	},
	{
		"id": "multilateral-assistance",
		"name": "Multilateral Assistance",
		"children": [
			{
				"id": "funds-appropriated-to-the-president-3",
				"name": "Funds Appropriated To The President ",
				"description": "For necessary expenses to carry out the provisions of section 301 of the Foreign Assistance Act of 1961.",
				"amount": 339000000.0
			},
			{
				"id": "international-financial-institutions",
				"name": "International Financial Institutions",
				"children": [
					{
						"id": "global-environment-facility",
						"name": "Global Environment Facility",
						"description": "For payment to the International Bank for Reconstruction and Development as trustee for the Global Environment Facility by the Secretary of the Treasury.",
						"amount": 139575000.0
					},
					{
						"id": "contribution-to-the-international-development-association",
						"name": "Contribution To The International Development Association",
						"description": "For payment to the International Development Association by the Secretary of the Treasury.",
						"amount": 1097010000.0
					},
					{
						"id": "contribution-to-the-asian-development-fund",
						"name": "Contribution To The Asian Development Fund",
						"description": "For payment to the Asian Development Bank's Asian Development Fund by the Secretary of the Treasury.",
						"amount": 47395000.0
					},
					{
						"id": "contribution-to-the-african-development-bank",
						"name": "Contribution To The African Development Bank",
						"description": "For payment to the African Development Bank by the Secretary of the Treasury for the United States share of the paid-in portion of the increase in capital stock.",
						"amount": 32417159.0
					},
					{
						"id": "contribution-to-the-african-development-fund",
						"name": "Contribution To The African Development Fund",
						"description": "For payment to the African Development Fund by the Secretary of the Treasury.",
						"amount": 171300000.0
					},
					{
						"id": "contribution-to-the-international-fund-for-agricultural-development",
						"name": "Contribution To The International Fund For Agricultural Development",
						"description": "For payment to the International Fund for Agricultural Development by the Secretary of the Treasury.",
						"amount": 30000000.0
					}
				]
			}
		]
	},
	{
		"id": "export-and-investment-assistance",
		"name": "Export And Investment Assistance",
		"children": [
			{
				"id": "export-import-bank-of-the-united-states",
				"name": "Export-Import Bank Of The United States",
				"description": "For necessary expenses of the Office of Inspector General in carrying out the provisions of the Inspector General Act of 1978, as amended.",
				"amount": 5700000.0
			},
			{
				"id": "overseas-private-investment-corporation",
				"name": "Overseas Private Investment Corporation",
				"children": [
					{
						"id": "program-account",
						"name": "Program Account",
						"description": "For the cost of direct and guaranteed loans as authorized by section 234 of the Foreign Assistance Act of 1961.",
						"amount": 20000000.0
					},
					{
						"id": "trade-and-development-agency",
						"name": "Trade And Development Agency",
						"description": "For necessary expenses to carry out the provisions of section 661 of the Foreign Assistance Act of 1961.",
						"amount": 79500000.0
					}
				]
			}
		]
	},
	{
		"id": "overseas-contingency-operations%2Fglobal-war-on-terrorism",
		"name": "Overseas Contingency Operations/Global War On Terrorism",
		"children": [
			{
				"id": "department-of-state-4",
				"name": "Department Of State",
				"children": [
					{
						"id": "administration-of-foreign-affairs-2",
						"name": "Administration Of Foreign Affairs",
						"children": [
							{
								"id": "diplomatic-programs-2",
								"name": "Diplomatic Programs",
								"description": "For an additional amount for Diplomatic Programs.",
								"amount": 3225971000.0
							},
							{
								"id": "office-of-inspector-general-21",
								"name": "Office Of Inspector General",
								"description": "For an additional amount for Office of Inspector General.",
								"amount": 54900000.0
							}
						]
					},
					{
						"id": "international-organizations-2",
						"name": "International Organizations",
						"children": [
							{
								"id": "contributions-to-international-organizations-2",
								"name": "Contributions To International Organizations",
								"description": "For an additional amount for Contributions to International Organizations.",
								"amount": 96240000.0
							},
							{
								"id": "contributions-for-international-peacekeeping-activities-2",
								"name": "Contributions For International Peacekeeping Activities",
								"description": "For an additional amount for Contributions for International Peacekeeping Activities.",
								"amount": 988656000.0
							}
						]
					}
				]
			},
			{
				"id": "united-states-agency-for-international-development-2",
				"name": "United States Agency For International Development",
				"description": "For an additional amount for Operating Expenses.",
				"amount": 158067000.0
			},
			{
				"id": "bilateral-economic-assistance-2",
				"name": "Bilateral Economic Assistance",
				"children": [
					{
						"id": "funds-appropriated-to-the-president-4",
						"name": "Funds Appropriated To The President",
						"children": [
							{
								"id": "international-disaster-assistance-2",
								"name": "International Disaster Assistance",
								"description": "For an additional amount for International Disaster Assistance.",
								"amount": 584278000.0
							},
							{
								"id": "transition-initiatives-2",
								"name": "Transition Initiatives",
								"description": "For an additional amount for Transition Initiatives.",
								"amount": 62043000.0
							},
							{
								"id": "economic-support-fund-2",
								"name": "Economic Support Fund",
								"description": "For an additional amount for Economic Support Fund.",
								"amount": 1172336000.0
							}
						]
					},
					{
						"id": "department-of-state-5",
						"name": "Department Of State",
						"description": "For an additional amount for Migration and Refugee Assistance to respond to refugee crises, including in Africa, the Near East, South and Central Asia, and Europe and Eurasia.",
						"amount": 1404124000.0
					}
				]
			},
			{
				"id": "international-security-assistance-2",
				"name": "International Security Assistance",
				"children": [
					{
						"id": "department-of-state-6",
						"name": "Department Of State",
						"description": "For an additional amount for Peacekeeping Operations.",
						"amount": 325213000.0
					},
					{
						"id": "funds-appropriated-to-the-president-5",
						"name": "Funds Appropriated To The President",
						"description": "For an additional amount for Foreign Military Financing Program.",
						"amount": 229372000.0
					}
				]
			}
		]
	},
	{
		"id": "department-of-transportation",
		"name": "Department Of Transportation",
		"children": [
			{
				"id": "office-of-the-secretary-5",
				"name": "Office Of The Secretary",
				"children": [
					{
						"id": "salaries-and-expenses-39",
						"name": "Salaries And Expenses",
						"description": "For necessary expenses of the Office of the Secretary.",
						"amount": 113910000.0
					},
					{
						"id": "research-and-technology",
						"name": "Research And Technology",
						"description": "For necessary expenses related to the Office of the Assistant Secretary for Research and Technology.",
						"amount": 8471000.0
					},
					{
						"id": "national-infrastructure-investments",
						"name": "National Infrastructure Investments",
						"description": "For capital investments in surface transportation infrastructure.",
						"amount": 900000000.0
					},
					{
						"id": "national-surface-transportation-and-innovative-finance-bureau",
						"name": "National Surface Transportation And Innovative Finance Bureau",
						"description": "For necessary expenses of the National Surface Transportation and Innovative Finance Bureau as authorized by 49 U.S.C. 116.",
						"amount": 5000000.0
					},
					{
						"id": "financial-management-capital",
						"name": "Financial Management Capital",
						"description": "For necessary expenses for upgrading and enhancing the Department of Transportation's financial systems and re-engineering business processes.",
						"amount": 2000000.0
					},
					{
						"id": "cyber-security-initiatives",
						"name": "Cyber Security Initiatives",
						"description": "For necessary expenses for cyber security initiatives, including necessary upgrades to wide area network and information technology infrastructure, improvement of network perimeter controls and identity management, testing and assessment of information technology against business, security, and other requirements, implementation of Federal cyber security initiatives and information infrastructure enhancements, and implementation of enhanced security controls on network devices.",
						"amount": 15000000.0
					},
					{
						"id": "office-of-civil-rights-2",
						"name": "Office Of Civil Rights",
						"description": "For necessary expenses of the Office of Civil Rights.",
						"amount": 9470000.0
					},
					{
						"id": "transportation-planning%2C-research%2C-and-development",
						"name": "Transportation Planning, Research, And Development",
						"description": "For necessary expenses for conducting transportation planning, research, systems development, development activities, and making grants.",
						"amount": 7879000.0
					},
					{
						"id": "minority-business-resource-center-program",
						"name": "Minority Business Resource Center Program",
						"description": "For necessary expenses of the Minority Business Resource Center, the provision of financial education outreach activities to eligible transportation-related small businesses, the monitoring of existing loans in the guaranteed loan program, and the modification of such loans of the Minority Business Resource Center.",
						"amount": 500000.0
					},
					{
						"id": "small-and-disadvantaged-business-utilization-and-outreach",
						"name": "Small And Disadvantaged Business Utilization And Outreach",
						"description": "For necessary expenses for small and disadvantaged business utilization and outreach activities.",
						"amount": 3488000.0
					},
					{
						"id": "administrative-provisions%E2%80%94office-of-the-secretary-of-transportation",
						"name": "Administrative Provisions—Office Of The Secretary Of Transportation",
						"children": [
							{
								"id": "federal-aviation-administration",
								"name": "Federal Aviation Administration",
								"description": "In addition to authority provided by section 327 of title 49, United States Code, the Department’s Working Capital Fund is hereby authorized to provide partial or full payments in advance and accept subsequent reimbursements from all Federal agencies from available funds for transit benefit distribution services that are necessary to carry out the Federal transit pass transportation fringe benefit program under Executive Order No. 13150 and section 3049 of Public Law 109–59: Provided, That the Department shall maintain a reasonable operating reserve in the Working Capital Fund, to be expended in advance to provide uninterrupted transit benefits to Government employees: Provided further, That such reserve will not exceed one month of benefits payable and may be used only for the purpose of providing for the continuation of transit benefits: Provided further, That the Working Capital Fund will be fully reimbursed by each customer agency from available funds for the actual cost of the transit benefit.",
								"children": [
									{
										"id": "operations",
										"name": "Operations",
										"description": "For necessary expenses of the Federal Aviation Administration, not otherwise provided for, including operations and research activities related to commercial space transportation, administrative expenses for research and development, establishment of air navigation facilities, the operation (including leasing) and maintenance of aircraft, subsidizing the cost of aeronautical charts and maps sold to the public, the lease or purchase of passenger motor vehicles for replacement only, in addition to amounts made available by Public Law 112–95.",
										"amount": 10410758000.0
									},
									{
										"id": "facilities-and-equipment",
										"name": "Facilities And Equipment",
										"description": "For necessary expenses, not otherwise provided for, for acquisition, establishment, technical support services, improvement by contract or purchase, and hire of national airspace systems and experimental facilities and equipment, as authorized under part A of subtitle VII of title 49, United States Code, including initial acquisition of necessary sites by lease or grant; engineering and service testing, including construction of test facilities and acquisition of necessary sites by lease or grant; construction and furnishing of quarters and related accommodations for officers and employees of the Federal Aviation Administration stationed at remote localities where such accommodations are not available; and the purchase, lease, or transfer of aircraft from funds available under this heading, including aircraft for aviation regulation and certification; to be derived from the Airport and Airway Trust Fund.",
										"amount": 3000000000.0
									},
									{
										"id": "research%2C-engineering%2C-and-development",
										"name": "Research, Engineering, And Development",
										"description": "For necessary expenses, not otherwise provided for, for research, engineering, and development, as authorized under part A of subtitle VII of title 49, United States Code, including construction of experimental facilities and acquisition of necessary sites by lease or grant.",
										"amount": 191100000.0
									},
									{
										"id": "grants-in-aid-for-airports",
										"name": "Grants-In-Aid For Airports",
										"description": "For liquidation of obligations incurred for grants-in-aid for airport planning and development, and noise compatibility planning and programs as authorized under subchapter I of chapter 471 and subchapter I of chapter 475 of title 49, United States Code, and under other law authorizing such obligations; for procurement, installation, and commissioning of runway incursion prevention devices and systems at airports of such title; for grants authorized under section 41743 of title 49, United States Code; and for inspection activities and administration of airport safety programs, including those related to airport operating certificates under section 44706 of title 49, United States Code.",
										"amount": 3000000000.0
									},
									{
										"id": "grants-in-aid-for-airports-2",
										"name": "Grants-In-Aid For Airports",
										"description": "For an additional amount for Grants-In-Aid for Airports, to enable the Secretary of Transportation to make grants for projects as authorized by subchapter 1 of chapter 471 and subchapter 1 of chapter 475 of title 49, United States Code.",
										"amount": 500000000.0
									}
								]
							},
							{
								"id": "federal-highway-administration",
								"name": "Federal Highway Administration",
								"description": "For the payment of obligations incurred in carrying out Federal-aid highway and highway safety construction programs authorized under title 23, United States Code.",
								"amount": 46007596000.0
							}
						]
					}
				]
			},
			{
				"id": "federal-motor-carrier-safety-administration",
				"name": "Federal Motor Carrier Safety Administration",
				"children": [
					{
						"id": "motor-carrier-safety-operations-and-programs",
						"name": "Motor Carrier Safety Operations And Programs",
						"description": "For payment of obligations incurred in the implementation, execution and administration of motor carrier safety operations and programs pursuant to section 31110 of title 49, United States Code, as amended by the Fixing America's Surface Transportation Act.",
						"amount": 284000000.0
					},
					{
						"id": "motor-carrier-safety-grants",
						"name": "Motor Carrier Safety Grants",
						"description": "For payment of obligations incurred in carrying out sections 31102, 31103, 31104, and 31313 of title 49, United States Code, as amended by the Fixing America's Surface Transportation Act.",
						"amount": 382800000.0
					},
					{
						"id": "administrative-provisions%E2%80%94federal-motor-carrier-safety-administration",
						"name": "Administrative Provisions—Federal Motor Carrier Safety Administration",
						"children": [
							{
								"id": "national-highway-traffic-safety-administration",
								"name": "National Highway Traffic Safety Administration",
								"description": "None of the funds appropriated or otherwise made available by this Act or any other Act may be used to implement, enforce or in any other way make effective the final rule published by the Federal Motor Carrier Safety Administration on May 27, 2015, entitled Lease and Interchange of Vehicles; Motor Carriers of Passengers.",
								"children": [
									{
										"id": "operations-and-research",
										"name": "Operations And Research",
										"description": "For expenses necessary to discharge the functions of the Secretary, with respect to traffic and highway safety authorized under chapter 301 and part C of subtitle VI of title 49, United States Code.",
										"amount": 190000000.0
									},
									{
										"id": "operations-and-research-2",
										"name": "Operations And Research",
										"description": "For payment of obligations incurred in carrying out the provisions of 23 U.S.C. 403, section 4011 of the Fixing America’s Surface Transportation Act (Public Law 114–94), and chapter 303 of title 49, United States Code.",
										"amount": 152100000.0
									},
									{
										"id": "highway-traffic-safety-grants",
										"name": "Highway Traffic Safety Grants",
										"description": "For payment of obligations incurred in carrying out provisions of 23 U.S.C. 402, 404, and 405, and section 4001(a)(6) of the Fixing America's Surface Transportation Act, to remain available until expended.",
										"amount": 610208000.0
									}
								]
							},
							{
								"id": "federal-railroad-administration",
								"name": "Federal Railroad Administration",
								"description": "In addition to the amounts made available under the heading, Operations and Research (Liquidation of Contract Authorization) (Limitation on Obligations) (Highway Trust Fund) for carrying out the provisions of section 403 of title 23, United States Code, $14,000,000, to remain available until September 30, 2020, shall be made available to the National Highway Traffic Safety Administration from the general fund, of which not to exceed $7,000,000 shall be available to provide funding for grants, pilot program activities, and innovative solutions to reduce impaired-driving fatalities in collaboration with eligible entities under section 403 of title 23, United States Code, and not to exceed $7,000,000 shall be available to continue a high visibility enforcement paid-media campaign regarding highway-rail grade crossing safety in collaboration with the Federal Railroad Administration.",
								"children": [
									{
										"id": "safety-and-operations",
										"name": "Safety And Operations",
										"description": "For necessary expenses of the Federal Railroad Administration, not otherwise provided for.",
										"amount": 221698000.0
									},
									{
										"id": "railroad-research-and-development",
										"name": "Railroad Research And Development",
										"description": "For necessary expenses for railroad research and development.",
										"amount": 40600000.0
									},
									{
										"id": "federal-state-partnership-for-state-of-good-repair",
										"name": "Federal-State Partnership For State Of Good Repair",
										"description": "For necessary expenses related to Federal-State Partnership for State of Good Repair Grants as authorized by section 24911 of title 49, United States Code.",
										"amount": 400000000.0
									},
									{
										"id": "consolidated-rail-infrastructure-and-safety-improvements",
										"name": "Consolidated Rail Infrastructure And Safety Improvements",
										"description": "For necessary expenses related to Consolidated Rail Infrastructure and Safety Improvements Grants, as authorized by section 24407 of title 49, United States Code.",
										"amount": 255000000.0
									},
									{
										"id": "restoration-and-enhancement",
										"name": "Restoration And Enhancement",
										"description": "For necessary expenses related to Restoration and Enhancement Grants, as authorized by section 24408 of title 49, United States Code.",
										"amount": 5000000.0
									},
									{
										"id": "magnetic-levitation-technology-deployment-program",
										"name": "Magnetic Levitation Technology Deployment Program",
										"description": "For necessary expenses related to the deployment of magnetic levitation transportation projects, consistent with language in 1307(a) through (c) of Public Law 109–59, as amended by section 102 of Public Law 110–244 (section 322 of title 23, United States Code).",
										"amount": 10000000.0
									}
								]
							}
						]
					}
				]
			},
			{
				"id": "federal-transit-administration",
				"name": "Federal Transit Administration",
				"children": [
					{
						"id": "administrative-expenses",
						"name": "Administrative Expenses",
						"description": "For necessary administrative expenses of the Federal Transit Administration's programs authorized by chapter 53 of title 49, United States Code.",
						"amount": 113165000.0
					},
					{
						"id": "transit-formula-grants",
						"name": "Transit Formula Grants",
						"description": "For payment of obligations incurred in the Federal Public Transportation Assistance Program in this account, and for payment of obligations incurred in carrying out the provisions of 49 U.S.C. 5305, 5307, 5310, 5311, 5312, 5314, 5318, 5329(e)(6), 5335, 5337, 5339, and 5340, as amended by the Fixing America's Surface Transportation Act, section 20005(b) of Public Law 112–141, and section 3006(b) of the Fixing America's Surface Transportation Act.",
						"amount": 9900000000.0
					},
					{
						"id": "transit-infrastructure-grants",
						"name": "Transit Infrastructure Grants",
						"description": "For an additional amount for buses and bus facilities grants under section 5339 of title 49, United States Code, state of good repair grants under section 5337 of such title, formula grants for rural areas under section 5311 of such title, high density state apportionments under section 5340(d) of such title, and the bus testing facilities under sections 5312 and 5318 of such title.",
						"amount": 700000000.0
					},
					{
						"id": "technical-assistance-and-training",
						"name": "Technical Assistance And Training",
						"description": "For necessary expenses to carry out 49 U.S.C. 5314.",
						"amount": 5000000.0
					},
					{
						"id": "capital-investment-grants",
						"name": "Capital Investment Grants",
						"description": "For necessary expenses to carry out fixed guideway capital investment grants under section 5309 of title 49, United States Code, and section 3005(b) of the Fixing America's Surface Transportation Act.",
						"amount": 2552687000.0
					},
					{
						"id": "grants-to-the-washington-metropolitan-area-transit-authority",
						"name": "Grants To The Washington Metropolitan Area Transit Authority",
						"description": "For grants to the Washington Metropolitan Area Transit Authority as authorized under section 601 of division B of Public Law 110–432.",
						"amount": 150000000.0
					},
					{
						"id": "administrative-provisions%E2%80%94federal-transit-administration",
						"name": "Administrative Provisions—Federal Transit Administration",
						"children": [
							{
								"id": null,
								"name": null,
								"description": "None of the funds made available under this Act may be used for the implementation or furtherance of new policies detailed in the Dear Colleague letter distributed by the Federal Transit Administration to capital investment grant program project sponsors on June 29, 2018.",
								"children": [
									{
										"id": "saint-lawrence-seaway-development-corporation",
										"name": "Saint Lawrence Seaway Development Corporation",
										"description": "For necessary expenses to conduct the operations, maintenance, and capital asset renewal activities on those portions of the Saint Lawrence Seaway owned, operated, and maintained by the Saint Lawrence Seaway Development Corporation.",
										"amount": 36000000.0
									},
									{
										"id": "maritime-administration",
										"name": "Maritime Administration",
										"children": [
											{
												"id": "maritime-security-program",
												"name": "Maritime Security Program",
												"description": "For necessary expenses to maintain and preserve a U.S.-flag merchant fleet to serve the national security needs of the United States.",
												"amount": 300000000.0
											},
											{
												"id": "operations-and-training",
												"name": "Operations And Training",
												"description": "For necessary expenses of operations and training activities authorized by law.",
												"amount": 149442000.0
											},
											{
												"id": "state-maritime-academy-operations",
												"name": " State Maritime Academy Operations ",
												"description": "For necessary expenses of operations, support and training activities for State Maritime Academies.",
												"amount": 345200000.0
											},
											{
												"id": "ship-disposal",
												"name": "Ship Disposal",
												"description": "For necessary expenses related to the disposal of obsolete vessels in the National Defense Reserve Fleet of the Maritime Administration.",
												"amount": 5000000.0
											},
											{
												"id": "maritime-guaranteed-loan-%28title-xi%29-program-account",
												"name": "Maritime Guaranteed Loan (Title Xi) Program Account",
												"description": "For administrative expenses to carry out the guaranteed loan program.",
												"amount": 3000000.0
											}
										]
									}
								]
							},
							{
								"id": null,
								"name": null,
								"description": "Notwithstanding any other provision of this Act, in addition to any existing authority, the Maritime Administration is authorized to furnish utilities and services and make necessary repairs in connection with any lease, contract, or occupancy involving Government property under control of the Maritime Administration: Provided, That payments received therefor shall be credited to the appropriation charged with the cost thereof and shall remain available until expended: Provided further, That rental payments under any such lease, contract, or occupancy for items other than such utilities, services, or repairs shall be covered into the Treasury as miscellaneous receipts.",
								"children": [
									{
										"id": "pipeline-and-hazardous-materials-safety-administration",
										"name": "Pipeline And Hazardous Materials Safety Administration",
										"children": [
											{
												"id": "operational-expenses",
												"name": " Operational Expenses",
												"description": "For necessary operational expenses of the Pipeline and Hazardous Materials Safety Administration.",
												"amount": 23710000.0
											},
											{
												"id": "hazardous-materials-safety",
												"name": "Hazardous Materials Safety",
												"description": "For expenses necessary to discharge the hazardous materials safety functions of the Pipeline and Hazardous Materials Safety Administration.",
												"amount": 58000000.0
											},
											{
												"id": "pipeline-safety",
												"name": "Pipeline Safety",
												"description": "For expenses necessary to carry out a pipeline safety program, as authorized by 49 U.S.C. 60107, and to discharge the pipeline program responsibilities of the Oil Pollution Act of 1990.",
												"amount": 165000000.0
											}
										]
									},
									{
										"id": "office-of-inspector-general-22",
										"name": "Office Of Inspector General",
										"description": "For necessary expenses of the Office of the Inspector General to carry out the provisions of the Inspector General Act of 1978, as amended.",
										"amount": 92600000.0
									}
								]
							}
						]
					}
				]
			}
		]
	},
	{
		"id": "department-of-housing-and-urban-development",
		"name": "Department Of Housing And Urban Development",
		"children": [
			{
				"id": "management-and-administration",
				"name": "Management And Administration",
				"children": [
					{
						"id": "executive-offices",
						"name": "Executive Offices",
						"description": "For necessary salaries and expenses for Executive Offices, which shall be comprised of the offices of the Secretary, Deputy Secretary, Adjudicatory Services, Congressional and Intergovernmental Relations, Public Affairs, Small and Disadvantaged Business Utilization, and the Center for Faith-Based and Neighborhood Partnerships.",
						"amount": 14900000.0
					},
					{
						"id": "administrative-support-offices",
						"name": "Administrative Support Offices",
						"description": "For necessary salaries and expenses for Administrative Support Offices.",
						"amount": 541500000.0
					}
				]
			},
			{
				"id": "program-office-salaries-and-expenses",
				"name": "Program Office Salaries And Expenses",
				"children": [
					{
						"id": "public-and-indian-housing",
						"name": "Public And Indian Housing",
						"description": "For necessary salaries and expenses of the Office of Public and Indian Housing.",
						"amount": 219800000.0
					},
					{
						"id": "community-planning-and-development",
						"name": "Community Planning And Development",
						"description": "For necessary salaries and expenses of the Office of Community Planning and Development.",
						"amount": 112344000.0
					},
					{
						"id": "housing",
						"name": "Housing",
						"description": "For necessary salaries and expenses of the Office of Housing.",
						"amount": 382500000.0
					},
					{
						"id": "policy-development-and-research",
						"name": "Policy Development And Research",
						"description": "For necessary salaries and expenses of the Office of Policy Development and Research.",
						"amount": 26000000.0
					},
					{
						"id": "fair-housing-and-equal-opportunity",
						"name": "Fair Housing And Equal Opportunity",
						"description": "For necessary salaries and expenses of the Office of Fair Housing and Equal Opportunity.",
						"amount": 72900000.0
					},
					{
						"id": "office-of-lead-hazard-control-and-healthy-homes",
						"name": "Office Of Lead Hazard Control And Healthy Homes",
						"description": "For necessary salaries and expenses of the Office of Lead Hazard Control and Healthy Homes.",
						"amount": 8600000.0
					}
				]
			},
			{
				"id": "public-and-indian-housing-2",
				"name": "Public And Indian Housing",
				"children": [
					{
						"id": "public-housing-capital-fund",
						"name": "Public Housing Capital Fund",
						"description": "For the Public Housing Capital Fund Program to carry out capital and management activities for public housing agencies, as authorized under section 9 of the United States Housing Act of 1937 (42 U.S.C. 1437g) (the Act) $2,775,000,000, to remain available until September 30, 2022: Provided, That notwithstanding any other provision of law or regulation, during fiscal year 2019, the Secretary of Housing and Urban Development may not delegate to any Department official other than the Deputy Secretary and the Assistant Secretary for Public and Indian Housing any authority under paragraph (2) of section 9(j) regarding the extension of the time periods under such section: Provided further, That for purposes of such section 9(j), the term obligate means, with respect to amounts, that the amounts are subject to a binding agreement that will result in outlays, immediately or in the future: Provided further, That of the total amount made available under this heading, up to $14,000,000 shall be to support ongoing public housing financial and physical assessment activities: Provided further, That of the total amount made available under this heading, up to $1,000,000 shall be to support the costs of administrative and judicial receiverships: Provided further, That of the total amount provided under this heading, not to exceed $30,000,000 shall be available for the Secretary to make grants, notwithstanding section 203 of this Act, to public housing agencies for emergency capital needs including safety and security measures necessary to address crime and drug-related activity as well as needs resulting from unforeseen or unpreventable emergencies and natural disasters excluding Presidentially declared emergencies and natural disasters under the Robert T. Stafford Disaster Relief and Emergency Act (42 U.S.C. 5121 et seq.) occurring in fiscal year 2019: Provided further, That of the amount made available under the previous proviso, not less than $10,000,000 shall be for safety and security measures: Provided further, That in addition to the amount in the previous proviso for such safety and security measures, any amounts that remain available, after all applications received on or before September 30, 2020, for emergency capital needs have been processed, shall be allocated to public housing agencies for such safety and security measures: Provided further, That of the total amount provided under this heading, up to $35,000,000 shall be for supportive services, service coordinators and congregate services as authorized by section 34 of the Act (42 U.S.C. 1437z–6) and the Native American Housing Assistance and Self-Determination Act of 1996 (25 U.S.C. 4101 et seq.): Provided further, That of the total amount made available under this heading.",
						"amount": 15000000.0
					},
					{
						"id": "public-housing-operating-fund",
						"name": "Public Housing Operating Fund",
						"description": "For 2019 payments to public housing agencies for the operation and management of public housing, as authorized by section 9(e) of the United States Housing Act of 1937 (42 U.S.C. 1437g(e)).",
						"amount": 4653116000.0
					},
					{
						"id": "choice-neighborhoods-initiative",
						"name": "Choice Neighborhoods Initiative",
						"description": "For competitive grants under the Choice Neighborhoods Initiative (subject to section 24 of the United States Housing Act of 1937 (42 U.S.C. 1437v), unless otherwise specified under this heading), for transformation, rehabilitation, and replacement housing needs of both public and HUD-assisted housing and to transform neighborhoods of poverty into functioning, sustainable mixed income neighborhoods with appropriate services, schools, public assets, transportation and access to jobs.",
						"amount": 150000000.0
					},
					{
						"id": "family-self-sufficiency",
						"name": "Family Self-Sufficiency",
						"description": "For the Family Self-Sufficiency program to support family self-sufficiency coordinators under section 23 of the United States Housing Act of 1937, to promote the development of local strategies to coordinate the use of assistance under sections 8(o) and 9 of such Act with public and private resources, and enable eligible families to achieve economic independence and self-sufficiency.",
						"amount": 80000000.0
					},
					{
						"id": "native-american-housing-block-grants",
						"name": "Native American Housing Block Grants",
						"description": "For the Native American Housing Block Grants program, as authorized under title I of the Native American Housing Assistance and Self-Determination Act of 1996 (NAHASDA) (25 U.S.C. 4111 et seq.).",
						"amount": 655000000.0
					},
					{
						"id": "indian-housing-loan-guarantee-fund-program-account",
						"name": "Indian Housing Loan Guarantee Fund Program Account",
						"description": "For the cost of guaranteed loans, as authorized by section 184 of the Housing and Community Development Act of 1992 (12 U.S.C. 1715z–13a).",
						"amount": 1440000.0
					},
					{
						"id": "native-hawaiian-housing-block-grant",
						"name": "Native Hawaiian Housing Block Grant",
						"description": "For the Native Hawaiian Housing Block Grant program, as authorized under title VIII of the Native American Housing Assistance and Self-Determination Act of 1996 (25 U.S.C. 4111 et seq.).",
						"amount": 2000000.0
					}
				]
			},
			{
				"id": "community-planning-and-development-2",
				"name": "Community Planning And Development",
				"children": [
					{
						"id": "housing-opportunities-for-persons-with-aids",
						"name": "Housing Opportunities For Persons With Aids",
						"description": "For carrying out the Housing Opportunities for Persons with AIDS program, as authorized by the AIDS Housing Opportunity Act (42 U.S.C. 12901 et seq.).",
						"amount": 393000000.0
					},
					{
						"id": "community-development-fund",
						"name": "Community Development Fund",
						"description": "For assistance to units of State and local government, and to other entities, for economic and community development activities, and for other purposes.",
						"amount": 3365000000.0
					},
					{
						"id": "home-investment-partnerships-program",
						"name": "Home Investment Partnerships Program",
						"description": "For the HOME Investment Partnerships program, as authorized under title II of the Cranston-Gonzalez National Affordable Housing Act, as amended.",
						"amount": 1250000000.0
					},
					{
						"id": "self-help-and-assisted-homeownership-opportunity-program",
						"name": "Self-Help And Assisted Homeownership Opportunity Program",
						"description": "For the Self-Help and Assisted Homeownership Opportunity Program, as authorized under section 11 of the Housing Opportunity Program Extension Act of 1996, as amended.",
						"amount": 54000000.0
					},
					{
						"id": "homeless-assistance-grants",
						"name": "Homeless Assistance Grants",
						"description": "For the Emergency Solutions Grants program as authorized under subtitle B of title IV of the McKinney-Vento Homeless Assistance Act, as amended; the Continuum of Care program as authorized under subtitle C of title IV of such Act; and the Rural Housing Stability Assistance program as authorized under subtitle D of title IV of such Act.",
						"amount": 2636000000.0
					}
				]
			},
			{
				"id": "housing-programs",
				"name": "Housing Programs",
				"children": [
					{
						"id": "project-based-rental-assistance",
						"name": "Project-Based Rental Assistance",
						"description": "For activities and assistance for the provision of project-based subsidy contracts under the United States Housing Act of 1937 (42 U.S.C. 1437 et seq.) (the Act), not otherwise provided for.",
						"amount": 11347000000.0
					},
					{
						"id": "housing-for-the-elderly",
						"name": "Housing For The Elderly",
						"description": "For capital advances, including amendments to capital advance contracts, for housing for the elderly, as authorized by section 202 of the Housing Act of 1959, as amended, for project rental assistance for the elderly under section 202(c)(2) of such Act, including amendments to contracts for such assistance and renewal of expiring contracts for such assistance for up to a 1-year term, for senior preservation rental assistance contracts, including renewals, as authorized by section 811(e) of the American Housing and Economic Opportunity Act of 2000, as amended, and for supportive services associated with the housing.",
						"amount": 678000000.0
					},
					{
						"id": "housing-for-persons-with-disabilities",
						"name": "Housing For Persons With Disabilities",
						"description": "For capital advances, including amendments to capital advance contracts, for supportive housing for persons with disabilities, as authorized by section 811 of the Cranston-Gonzalez National Affordable Housing Act (42 U.S.C. 8013), as amended, for project rental assistance for supportive housing for persons with disabilities under section 811(d)(2) of such Act, for project assistance contracts pursuant to section 202(h) of the Housing Act of 1959 (Public Law 86–372; 73 Stat. 667), including amendments to contracts for such assistance and renewal of expiring contracts for such assistance for up to a 1-year term, for project rental assistance to State housing finance agencies and other appropriate entities as authorized under section 811(b)(3) of the Cranston-Gonzalez National Housing Act, and for supportive services associated with the housing for persons with disabilities as authorized by section 811(b)(1) of such Act.",
						"amount": 184155000.0
					},
					{
						"id": "housing-counseling-assistance",
						"name": "Housing Counseling Assistance",
						"description": "For contracts, grants, and other assistance excluding loans, as authorized under section 106 of the Housing and Urban Development Act of 1968, as amended.",
						"amount": 50000000.0
					},
					{
						"id": "rental-housing-assistance",
						"name": "Rental Housing Assistance",
						"description": "For amendments to contracts under section 101 of the Housing and Urban Development Act of 1965 (12 U.S.C. 1701s) and section 236(f)(2) of the National Housing Act (12 U.S.C. 1715z–1) in State-aided, noninsured rental housing projects.",
						"amount": 5000000.0
					}
				]
			},
			{
				"id": "policy-development-and-research-2",
				"name": "Policy Development And Research",
				"description": "For contracts, grants, and necessary expenses of programs of research and studies relating to housing and urban problems, not otherwise provided for, as authorized by title V of the Housing and Urban Development Act of 1970 (12 U.S.C. 1701z–1 et seq.), including carrying out the functions of the Secretary of Housing and Urban Development under section 1(a)(1)(i) of Reorganization Plan No. 2 of 1968, and for technical assistance.",
				"amount": 96000000.0
			},
			{
				"id": "fair-housing-and-equal-opportunity-2",
				"name": "Fair Housing And Equal Opportunity",
				"description": "For contracts, grants, and other assistance, not otherwise provided for, as authorized by title VIII of the Civil Rights Act of 1968, as amended by the Fair Housing Amendments Act of 1988, and section 561 of the Housing and Community Development Act of 1987, as amended.",
				"amount": 65300000.0
			},
			{
				"id": "office-of-lead-hazard-control-and-healthy-homes-2",
				"name": "Office Of Lead Hazard Control And Healthy Homes",
				"description": "For the Lead Hazard Reduction Program, as authorized by section 1011 of the Residential Lead-Based Paint Hazard Reduction Act of 1992.",
				"amount": 279000000.0
			},
			{
				"id": "information-technology-fund",
				"name": "Information Technology Fund",
				"description": "For the development, modernization, and enhancement of, modifications to, and infrastructure for Department-wide and program-specific information technology systems, for the continuing operation and maintenance of both Department-wide and program-specific information systems, and for program-related maintenance activities.",
				"amount": 280000000.0
			},
			{
				"id": "office-of-inspector-general-23",
				"name": "Office Of Inspector General",
				"description": "For necessary salaries and expenses of the Office of Inspector General in carrying out the Inspector General Act of 1978, as amended.",
				"amount": 128082000.0
			}
		]
	},
	{
		"id": "related-agencies-6",
		"name": "Related Agencies",
		"children": [
			{
				"id": "access-board",
				"name": "Access Board",
				"description": "For expenses necessary for the Access Board, as authorized by section 502 of the Rehabilitation Act of 1973, as amended.",
				"amount": 8400000.0
			},
			{
				"id": "federal-maritime-commission",
				"name": "Federal Maritime Commission",
				"description": "For necessary expenses of the Federal Maritime Commission as authorized by section 201(d) of the Merchant Marine Act, 1936, as amended (46 U.S.C. 307), including services as authorized by 5 U.S.C. 3109; hire of passenger motor vehicles as authorized by 31 U.S.C. 1343(b); and uniforms or allowances therefore, as authorized by 5 U.S.C. 5901–5902.",
				"amount": 27490000.0
			},
			{
				"id": "office-of-inspector-general-24",
				"name": "Office Of Inspector General",
				"description": "For necessary expenses of the Office of Inspector General for the National Railroad Passenger Corporation to carry out the provisions of the Inspector General Act of 1978, as amended.",
				"amount": 23274000.0
			},
			{
				"id": "national-transportation-safety-board",
				"name": "National Transportation Safety Board",
				"description": "For necessary expenses of the National Transportation Safety Board, including hire of passenger motor vehicles and aircraft; services as authorized by 5 U.S.C. 3109, but at rates for individuals not to exceed the per diem rate equivalent to the rate for a GS–15; uniforms, or allowances therefor, as authorized by law (5 U.S.C. 5901–5902).",
				"amount": 110400000.0
			},
			{
				"id": "neighborhood-reinvestment-corporation",
				"name": "Neighborhood Reinvestment Corporation",
				"description": "For payment to the Neighborhood Reinvestment Corporation for use in neighborhood reinvestment activities, as authorized by the Neighborhood Reinvestment Corporation Act (42 U.S.C. 8101–8107).",
				"amount": 150000000.0
			},
			{
				"id": "surface-transportation-board",
				"name": "Surface Transportation Board",
				"description": "For necessary expenses of the Surface Transportation Board, including services authorized by 5 U.S.C. 3109.",
				"amount": 37100000.0
			},
			{
				"id": "united-states-interagency-council-on-homelessness",
				"name": "United States Interagency Council On Homelessness",
				"description": "For necessary expenses (including payment of salaries, authorized travel, hire of passenger motor vehicles, the rental of conference rooms, and the employment of experts and consultants under section 3109 of title 5, United States Code) of the United States Interagency Council on Homelessness in carrying out the functions pursuant to title II of the McKinney-Vento Homeless Assistance Act, as amended.",
				"amount": 3600000.0
			}
		]
	}
]